rule_id: TDL-C2-000644
v4_id: '000644'
name: Suspicious Microsoft Teams Chat Creation from Foreign Tenant - O365
description: Detects when a Microsoft Teams chat is created by a user from a foreign tenant. This could be an attempt to phish
  an internal user for their credentials.
tactic: Command and Control
tactic_id: TA0011
technique_id: T1078
technique_name: Valid Accounts
platform:
- Windows
data_sources:
- Microsoft Teams
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_c2_000644 {
      meta:
        author = "TDE"
        description = "Suspicious Microsoft Teams Chat Creation from Foreign Tenant - O365"
        severity = "MEDIUM"
        tactic = "TA0011"
        technique = "T1078"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- command-and-control
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  1 Microsoft Teams Chat Creation Event
  Where the Communication Type is "OnetoOne"
  Where the Source User contains "help" or "admin"
  Where the Source User is from a Foreign Tenant
  Where the Source User Domain ends in ".onmicrosoft.com"
