rule_id: TDL-C2-000101
v4_id: '000101'
name: EC2 Suspicious Outbound Communication
description: Detects when there is traffic from a EC2 to an external host labeled as malicious by GuardDuty.
tactic: Command and Control
tactic_id: TA0011
technique_id: T1071
technique_name: Application Layer Protocol
platform:
- Windows
data_sources:
- Windows Security Event Log
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | table _time, host, user, _raw'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_c2_000101 {
      meta:
        author = "TDL"
        description = "EC2 Suspicious Outbound Communication"
        severity = "HIGH"
        tactic = "TA0011"
        technique = "T1071"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized pen testing
- Security research
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- thr
- command-and-control
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
suppression:
  window: 8 hours
tuning_period: 7 days
