rule_id: TDL-C2-000544
v4_id: '000544'
name: Advance Security Disabled
description: "Detect when a GitHub Advanced Security setting has been disabled.Disabling this turns off the followiung protections\
  \ Code scanning\t, CodeQL CLI, Secret scanning, Custom auto-triage rules, Dependency review."
tactic: Command and Control
tactic_id: TA0011
technique_id: T1078
technique_name: Valid Accounts
platform:
- Windows
data_sources:
- Github
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_c2_000544 {\n  meta:\n    author = \"TDL\"\n    description = \"Advance Security Disabled\"\n    severity\
    \ = \"HIGH\"\n    tactic = \"TA0011\"\n    technique = \"T1078\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 5m\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1078*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- command-and-control
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Github event\n   where actions IN (business_advanced_security.disabled, org.advanced_security_disabled_on_all_repos,\
  \ business_advanced_security.disabled_for_new_repos, org.advanced_security_disabled_for_new_repos, repo.advanced_security_disabled,\
  \ business.advanced_security_policy_update, org.advanced_security_policy_selected_member_disabled)"
