title: Azure Suspicious Guest User Activity
id: TDL-AUTH-000375
status: stable
description: Detects when a guest user is found attempting to use various PowerShell CLI within Azure.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1059
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 1685
    - 4564
    - 4950
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000375'
