title: Blocked Log4J Exploit Signature Detection
id: TDL-AUTH-000503
status: experimental
description: Detects when traffic is blocked with a Log4j signature
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1190
- detection.net
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Blocked Log4J Exploit Signature Detection
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000503'
