title: Guest User Privilege Escalation - Slack
id: TDL-AUTH-000685
status: experimental
description: Detects when a newly created or reactivated user is given higher level privileges. This could
  be a sign of a threat actor trying to escalate privileges within a Slack org.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Guest User Privilege Escalation - Slack
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: 000685
