title: Anonymous User SharePoint Access
id: TDL-AUTH-000025
status: stable
description: Detects when an anonymous user accesses a SharePoint or OneDrive resource through an anonymous
  link. Anonymous links can be used by any authenticated or unauthenticated users and may lead to leaking
  sensitive data outside of the organization.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1133
- detection.auth
- detection.initial-access
logsource:
  service: office365
  product: m365
detection:
  selection:
    Keywords:
    - Anonymous User SharePoint Access
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000025'
