title: Stealth Remote Password Spraying
id: TDL-AUTH-000284
status: experimental
description: This rule is designed to detect a low and slow password spray attempt against a VPN or public-facing
  host. This could indicate an attacker attempting a single password across multiple accounts
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 3654
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000284
