title: Malicious RDP Traffic - Outbound
id: TDL-AUTH-000104
status: stable
description: Detects outbound malicious RDP traffic to a known threat host.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1021
- detection.thr
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 3389
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: high
custom:
  v4_id: '000104'
