title: Remote Login from Threat Host
id: TDL-AUTH-000024
status: stable
description: Detects a successful logon from an external source that resides on a threat feed.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.thr
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 3651
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: high
custom:
  v4_id: '000024'
