title: Unauthorized Kubernetes Service Account Created
id: TDL-AUTH-000584
status: experimental
description: 'Detects creation of new Kubernetes service account by an unauthorized account, which could
  indicate an attacker''s attempt to persist within a cluster.


  ref: https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/container%20service%20account/'
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Unauthorized Kubernetes Service Account Created
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000584
