title: Remote Password Spraying
id: TDL-AUTH-000044
status: stable
description: This rule is designed to detect multiple failed authentication attempts against a VPN or
  public-facing host targeting multiple accounts. This could indicate an attacker attempting a single
  password across multiple accounts
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 3655
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000044'
