title: HVT User Account Lockout
id: TDL-AUTH-000111
status: stable
description: Detects when a high value target account is locked out. This is indicative of a potential
  brute force attack targeting the account.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1531
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47401
    - 4740
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000111'
