title: Server-Side Code Injection in URL
id: TDL-AUTH-000534
status: experimental
description: Attackers may use improper URL checking to inject code that is executed on a server.  This
  may be used in DoS attacks or to execute commands to elevate privilege.  The attack pattern is similar
  to Shellshock exploitation.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1190
- detection.net
- detection.initial-access
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - Server-Side Code Injection in URL
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000534'
