title: Stealth Remote Password Guessing
id: TDL-AUTH-000285
status: experimental
description: This rule is designed to detect a low and slow password guessing attempt against a VPN or
  public-facing host, which may indicate an attempt to brute force an account’s password.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 3654
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000285
