title: HVT Remote Password Guessing
id: TDL-AUTH-000527
status: stable
description: This rule is designed to detect multiple failed authentication attempts against a VPN or
  public-facing host, which may indicate an attempt to brute force an account’s password.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 36575
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000527'
