title: First Seen Remote Login from ASN Org
id: TDL-AUTH-000400
status: experimental
description: Detects a user successfully logging in from an ASN that hasn't been seen in the last 90 days
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: signinlogs
  product: azure
detection:
  selection:
    EventID:
    - 3651
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000400'
