title: Stealth Password Spraying - Domain Controller - 4776
id: TDL-AUTH-000282
status: experimental
description: Detects a potential low and slow password spraying attack against Windows accounts. Attackers
  may have gathered a list of user accounts and could be attempting to use common passwords against each
  one in order to compromise the accounts. Authentications relayed to a domain controller do not log the
  true source host, so the password attack cannot be traced back to a particular host. However, a consistent
  low amount of failures over a long period of time from a single source could indicate malicious activity
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47764
    - 4776
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000282
