title: Stealth Password Spraying
id: TDL-AUTH-000276
status: experimental
description: Detects a potential low and slow password spraying attack against Windows accounts. Attackers
  may have gathered a list of user accounts and could be attempting to use common passwords against each
  one in order to compromise the accounts. The attacker, in this instance, is preforming the spray at
  a slow rate to avoid detection and prevent lockouts.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46254
    - 4625
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000276'
