title: Repeat Account Lockout
id: TDL-AUTH-000270
status: stable
description: Designed to detect multiple account lockout events for a user in a 60 minute period. Investigate
  the source of the failed logins as well as any cause of the failed logins (wrong password, process logging
  in)
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1531
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47405
    - 4740
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000270'
