title: Password Guessing
id: TDL-AUTH-000006
status: stable
description: Detects a potential password guessing attack against an account from a single source.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: syslog
  product: linux
detection:
  selection:
    EventID:
    - 4625
    - 4776
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000006'
