title: Java Class Proxy Download
id: TDL-AUTH-000445
status: experimental
description: Detects Java class download in proxy logs, e.g. used in Log4shell exploitation attacks against
  Log4j.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.net
- detection.initial-access
logsource:
  category: proxy
detection:
  selection:
    Keywords:
    - Java Class Proxy Download
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000445'
