title: Password Spraying - 4776
id: TDL-AUTH-000038
status: stable
description: Detects a potential password spraying attack against Windows accounts. Attackers may have
  gathered a list of user accounts and could be attempting to use common passwords against each one in
  order to compromise the accounts.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47765
    - 4776
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000038
