title: Allowed Remote Code Execution Attempt
id: TDL-AUTH-000553
status: experimental
description: Detects when inbound traffic with a Remote Code Injection signature is allowed
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1190
- detection.net
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Allowed Remote Code Execution Attempt
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000553'
