title: Successful RDP Connection - Inbound
id: TDL-AUTH-000057
status: stable
description: A report that provides visibility into successful inbound RDP connections.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1021
- detection.auth
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 3389
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000057'
