title: Interactive Logon to Domain Controller - Offhours
id: TDL-AUTH-000010
status: stable
description: Detects an interactive logon to a Domain Controller after hours. This could indicate a form
  of insider threat occurring on a Domain Controller.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46241
    - 4624
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: '000010'
