title: AWS Privilege Escalation via Role Policy
id: TDL-AUTH-000179
status: stable
description: Detects an attacker escalating the privileges of an AWS role. If the attacker has access
  to the role, the attacker will then have escalated privileges.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS Privilege Escalation via Role Policy
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000179
