title: Unauthorized Addition to HVT Group
id: TDL-AUTH-000014
status: stable
description: Detects when an unauthorized user is added from a High Value Target Group. This could be
  an indicator of someone elevating their privileges.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4728
    - 4732
    - 47561
    - 4756
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: '000014'
