title: Domain Password Spray Commandlet Activity
id: TDL-AUTH-000514
status: experimental
description: Detects when a PowerShell script or command line contains the commandlets to perform a password
  spray.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1204
- detection.edp
- detection.initial-access
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
    - 4104
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000514'
