title: Blocked SQL Injection Attempt
id: TDL-AUTH-000554
status: experimental
description: Detects when inbound traffic with a SQL Injection signature is blocked
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1190
- detection.net
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Blocked SQL Injection Attempt
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000554'
