title: User Click Permitted
id: TDL-AUTH-000220
status: stable
description: Detects when a user has "clicked" or interacted with an e-mail that has been classified malicious.
  Attackers will typically send phishing e-mails to users in an attempt to gain access to the organization's
  network.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1566
- detection.net
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - User Click Permitted
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000220'
