title: Webserver Command Injection Attempt
id: TDL-AUTH-000236
status: stable
description: Detects a host attempting to call the command line on a web server to execute remote commands
  and if the web server is vulnerable to injection, an attacker can pipe commands into CMD that will be
  processed by the server.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1202
- detection.net
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Webserver Command Injection Attempt
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000236'
