title: HVT Account Password Reset by Unauthorized User
id: TDL-AUTH-000017
status: stable
description: Detects when the password of a high value target account has been changed by an unauthorized
  user.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47241
    - 4724
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000017'
