title: Successful SQL Injection
id: TDL-AUTH-000242
status: stable
description: Detects when a SQL injection is successful in exfiltrating data from a web server’s database.
  After an injection attempt, the firewall session will log a large amount of bytes being sent back to
  the external source, indicating a successful injection.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1190
- detection.net
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Successful SQL Injection
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000242'
