title: Guest User Created - Slack
id: TDL-AUTH-000677
status: experimental
description: Detects when a guest user is created in Slack
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Guest User Created - Slack
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000677'
