title: Wiz Critical Severity Detection
id: TDL-AUTH-000608
status: experimental
description: Detects a Cloud Event Rule from the Wiz platform.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Wiz Critical Severity Detection
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: critical
custom:
  v4_id: 000608
