title: Successful Password Spray
id: TDL-AUTH-000286
status: experimental
description: Detects a successful login from an internal location after the IP or host has been identified
  by password spraying internally. This could indicate that an attacker was successful in guessing a user’s
  password and has compromised their account.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46241
    - 4624
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000286
