title: Wiz Low Severity Detection
id: TDL-AUTH-000605
status: experimental
description: Detects a Cloud Event Rule from the Wiz platform.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1078
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Wiz Low Severity Detection
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000605'
