title: First Seen Allowed Outbound RDP Traffic
id: TDL-AUTH-000611
status: experimental
description: A rule that detects allowed outbound RDP traffic from an IP that hasn’t been seen in the
  last 90 days
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1021
- detection.net
- detection.initial-access
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 3389
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000611'
