title: Domain Account Enabled by Unauthorized User
id: TDL-AUTH-000139
status: stable
description: Detects when a domain account is enabled by an unauthorized user. This activity is commonly
  preformed by domain admins.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.initial-access
- attack.t1098
- detection.auth
- detection.initial-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47221
    - 4722
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000139
