title: Possible Ransomware Detected - Varonis
id: TDL-IMP-000645
status: stable
description: Detects when multiple files have been encrypted within a short period. This could be related
  to the modification of file extensions or the creation of files with known ransomware related extensions.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.impact
- attack.t1486
- detection.edp
- detection.impact
logsource:
  service: security
  product: windows
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000645'
