title: Deployment Deleted From Kubernetes Cluster
id: TDL-IMP-000580
status: experimental
description: 'Detects the removal of a deployment from a Kubernetes cluster. This could indicate disruptive
  activity aiming to impact business operations. Sigma rule by "Leo Tsaousis (@laripping)"


  ref: https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Data%20destruction/'
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.impact
- attack.t1498
- detection.edp
- detection.impact
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Deployment Deleted From Kubernetes Cluster
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: low
custom:
  v4_id: 000580
