title: Ransomware Staging - Mass File Rename
id: TDL-IMP-001
status: stable
description: ''
references: []
author: TDL
date: '2024-03-01'
modified: '2026-04-27'
tags:
- attack.impact
- attack.t1486
- detection.ransomware
- detection.encryption
logsource:
  category: file_event
  product: windows
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- File sync clients during bulk sync
level: critical
