title: Shadow Copy Deletion via vssadmin or wmic
id: TDL-IMP-002
status: stable
description: ''
references: []
author: TDL
date: '2024-03-01'
modified: '2026-04-27'
tags:
- attack.impact
- attack.t1490
- detection.vss
- detection.shadow-copy
- detection.ransomware
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
    - 4688
    Image|endswith|any:
    - \vssadmin.exe
    - \wmic.exe
    - \wbadmin.exe
    CommandLine|contains|any:
    - delete
    - shadowcopy
  condition: selection
falsepositives:
- Authorized backup solutions managing shadow storage
level: critical
