title: Custom Google Workspace Email Route Created or Modified
id: TDL-IMP-000300
status: stable
description: Detects when a custom Gmail route is added or modified in Google Workspace. Adversaries can
  add a custom e-mail route for outbound mail to route these e-mails to their own inbox of choice for
  data gathering. This allows adversaries to capture sensitive information from e-mail and potential attachments,
  such as invoices or payment documents. By default, all email from current Google Workspace users with
  accounts are routed through a domain's mail server for inbound andoutbound mail.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.impact
- attack.t1498
- detection.auth
- detection.impact
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Custom Google Workspace Email Route Created or Modified
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000300'
