title: Kubernetes RBAC Permission Enumeration Attempt
id: TDL-DIS-000583
status: experimental
description: 'Detects identities attempting to enumerate their Kubernetes RBAC permissions. In the early
  stages of a breach, attackers will aim to list the permissions they have within the compromised environment.
  In a Kubernetes cluster, this can be achieved by interacting with the API server, and querying the SelfSubjectAccessReview
  API via e.g. a "kubectl auth can-i --list" command. This will enumerate the Role-Based Access Controls
  (RBAC) rules defining the compromised user''s authorization. Sigma rule created by Leo Tsaousis (@laripping)


  ref: https://www.elastic.co/guide/en/security/current/kubernetes-suspicious-self-subject-review.html'
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1069
- detection.auth
- detection.discovery
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Kubernetes RBAC Permission Enumeration Attempt
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000583
