title: ICMP Host Discovery - Internal
id: TDL-DIS-000474
status: experimental
description: Detects when an internal host pings hundreds of other hosts. This could be an attacker trying
  to discover what hosts are in the network.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1046
- detection.net
- detection.discovery
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - ICMP Host Discovery - Internal
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000474'
