title: Port Scan Detected - Inbound
id: TDL-DIS-000055
status: stable
description: Detects a port scan from an external host to an internal host. Attackers will use port scans
  to perform reconnaissance to determine open services on a target.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1046
- detection.net
- detection.discovery
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 1024
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000055'
