title: Unauthorized DNS Zone Transfer
id: TDL-DIS-000190
status: stable
description: Detects a host that is not a DNS server attempting to complete a zone transfer, which is
  used to replicate DNS data between DNS servers. An attacker initiating a zone transfer can acquire the
  records for the entire domain. This data includes hostnames, IPs, and other information useful to the
  attacker’s reconnaissance.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1082
- detection.net
- detection.discovery
logsource:
  category: dns
detection:
  selection:
    Keywords:
    - Unauthorized DNS Zone Transfer
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: 000190
