title: Service Discovery - Inbound
id: TDL-DIS-000056
status: stable
description: Detects an external host sending packets to several destinations over a single port to map
  the network or discover live hosts to exploit.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1046
- detection.net
- detection.discovery
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 1024
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000056'
