title: SMB Scan - Outbound
id: TDL-DIS-000035
status: stable
description: Detects an internal host scanning for open SMB ports outbound to external hosts. This could
  indicate an attacker or malware on a compromised internal host attempting to scan other hosts to propagate.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1046
- detection.net
- detection.discovery
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - SMB Scan - Outbound
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000035'
