title: Port Scan Detected - Internal
id: TDL-DIS-000033
status: stable
description: Detects a port scan from one internal host to another. Attackers will use port scans to perform
  reconnaissance to determine open services on the target.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1046
- detection.net
- detection.discovery
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 1024
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000033'
