title: LDAP Enumeration - Bulk Active Directory Object Queries
id: TDL-DIS-002
status: stable
description: ''
references: []
author: TDL
date: '2024-02-21'
modified: '2026-04-27'
tags:
- attack.discovery
- attack.t1087_002
- detection.ldap
- detection.bloodhound
- detection.discovery
- detection.domain-enumeration
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4661
  condition: selection
falsepositives:
- Identity management platforms
- HR system AD integrations
level: high
