title: Windows Script Host Executing Remote Payload
id: TDL-EXE-002
status: stable
description: ''
references: []
author: TDL
date: '2024-01-15'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1059_005
- detection.wscript
- detection.cscript
- detection.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
    - 4688
  condition: selection
falsepositives:
- Legitimate logon scripts from network shares
level: high
