title: Kubernetes Failed Curl Authentication
id: TDL-EXE-000591
status: experimental
description: Failed instances of curl usage within a containerized environment should occur rarely, investigate
  the source IP address used to ensure that it is legitimate.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1609
- detection.auth
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Kubernetes Failed Curl Authentication
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000591
