title: PowerSploit Commandlet Activity
id: TDL-EXE-000509
status: experimental
description: Detects when a PowerSploit commandlet is seen within the enviroment.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
    - 4104
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: 000509
