title: PSEXEC Detection
id: TDL-EXE-000152
status: stable
description: Detects an attacker pivoting internally using PSEXEC. PSEXEC is a common administrator tool
  used to remotely execute commands and manage systems. PSEXEC connects to the ADMIN$ share of an internal
  host and then immediately installs a windows service image. This rule is designed to detect this type
  of activity.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1021
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 7045
    ServiceName|contains: PSEXESVC
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000152'
