title: Malicious File Hash Detected on Host
id: TDL-EXE-000084
status: stable
description: This rule is designed to detect when a hash found on a Threat Intelligence Feed is seen in
  the environment. This could be indicate malicious activity or compromise with confidence.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.thr
- detection.execution
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Malicious File Hash Detected on Host
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: medium
custom:
  v4_id: 000084
