title: Web Request to Hard Coded IP
id: TDL-EXE-000479
status: experimental
description: Detects a web request to a hard coded IP domain
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.net
- detection.execution
logsource:
  category: proxy
detection:
  selection:
    Keywords:
    - Web Request to Hard Coded IP
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: 000479
