title: HTTP Traffic Pattern to Hard Coded IP
id: TDL-EXE-000067
status: stable
description: Detects when a single IP connects to a single hard coded IP site. This could be an indicator
  of malware beaconing out to newly stood up C2 hosts.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.net
- detection.execution
logsource:
  category: proxy
detection:
  selection:
    Keywords:
    - HTTP Traffic Pattern to Hard Coded IP
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000067'
