title: Vulnerable Driver Detected
id: TDL-EXE-000587
status: experimental
description: Detects when a host has a vulnerable driver.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1068
- detection.edp
- detection.execution
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Vulnerable Driver Detected
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000587
