title: PowerShell DNSExfiltration
id: TDL-EXE-000521
status: experimental
description: Detects the use of DNSExfiltrator within a PowerShel Script or command. Derived from a Sigma
  rule created by "frack113".
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
    - 4104
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000521'
