title: Malware Not Cleaned
id: TDL-EXE-000047
status: stable
description: This rule is designed to alert on malware detected by the AV that was not successfully quarantined
  or removed. Investigation on the file and host should be performed. As well as RCA to determine why
  the file was not quarantined.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Malware Not Cleaned
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000047'
