title: Possible Impacket Lateral Movement
id: TDL-EXE-000424
status: experimental
description: Detects commands from the Impacket framework where an attacker will attempt to use an semi-interactive
  shell via WMI or SMB to execute commands for lateral movement.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1047
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 7045
    ServiceName|contains: PSEXESVC
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000424'
