title: Potential Kubernetes Sidecar Injection
id: TDL-EXE-000585
status: experimental
description: 'Detects attempts to inject a sidecar container into a running deployment. A sidecar container
  is an additional container within a pod, that resides alongside the main container. One way to add containers
  to running resources like Deployments/DeamonSets/StatefulSets, is via a "kubectl patch" operation. By
  injecting a new container within a legitimate pod, an attacker can run their code and hide their activity,
  instead of running their own separated pod in the cluster. A sigma rule by Leo Tsaousis (@laripping)


  ref: https://kubernetes.io/docs/tasks/manage-kubernetes-objects/update-api-object-kubectl-patch

  https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Sidecar%20Injection/'
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1610
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Potential Kubernetes Sidecar Injection
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000585
