title: Abnormal LSASS Parent Child Relationship
id: TDL-EXE-000200
status: stable
description: Detects potential lsass.exe abuse based on unusual and suspicious parent-child relationships.
  Lsass doesn’t typically spawn additional processes. This also detects suspicious parent processes of
  lsass, which may indicate LSASS memory access attempts.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1569
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    TargetImage|endswith: \lsass.exe
    GrantedAccess|contains|any:
    - '0x1010'
    - '0x1410'
    - '0x1fffff'
    - '0x1438'
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000200'
