title: ScreenConnect Remote Access Detection
id: TDL-EXE-000526
status: experimental
description: Detects when ScreenConnect starts and establishes remote access to that system (not meeting,
  not remote support)
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
  condition: selection
falsepositives:
- 'ref: https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling'
level: high
custom:
  v4_id: '000526'
