title: Cobalt Strike Installation via Powershell
id: TDL-EXE-000658
status: experimental
description: Detects Cobalt Strike Installation via Powershell.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1569
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 7045
    - 46971
    - 4697
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: critical
custom:
  v4_id: 000658
