title: Microsoft Office Access Token Scraping Commandlet Activity
id: TDL-EXE-000518
status: experimental
description: Detects when commandlets around office token scaping is found in a PowerShell script or command.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
    - 4104
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000518
