title: Regsvr32 Executing Remote SCT Scriptlet (Squiblydoo)
id: TDL-EXE-005
status: stable
description: ''
references: []
author: TDL
date: '2024-01-17'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1218_010
- detection.regsvr32
- detection.squiblydoo
- detection.lolbin
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
    - 4688
    Image|endswith: \regsvr32.exe
    CommandLine|contains:
    - scrobj.dll
    - http://
    - https://
  condition: selection
falsepositives:
- Extremely rare in production
level: critical
