title: Non-standard Process Launching LSASS
id: TDL-EXE-000205
status: experimental
description: Detects when a non-standard process launches lsass.exe. This could indicate an attacker is
  executing malicious code that is calling the process in a non-standard method to bypass controls.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1003
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    TargetImage|endswith: \lsass.exe
    GrantedAccess|contains|any:
    - '0x1010'
    - '0x1410'
    - '0x1fffff'
    - '0x1438'
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000205'
