title: MSHTA Executing Remote HTA Application
id: TDL-EXE-004
status: stable
description: ''
references: []
author: TDL
date: '2024-01-16'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1218_005
- detection.mshta
- detection.lolbin
- detection.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID:
    - 4688
    Image|endswith: \mshta.exe
    CommandLine|contains:
    - http://
    - https://
    - 'javascript:'
    - 'vbscript:'
  condition: selection
falsepositives:
- Legacy enterprise applications using HTA
level: high
