title: Ransomware AV Detection
id: TDL-EXE-000050
status: stable
description: Detects an anti-virus notification for ransomware found on a host. Even if the anti-virus
  reports the ransomware was cleaned, there may be other undetected parts of the ransomware that were
  not cleaned and still active.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1486
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: critical
custom:
  v4_id: '000050'
