title: EmpireProject/Empire PowerShell Command Detected
id: TDL-EXE-000224
status: stable
description: Empire is a pure PowerShell post-exploitation agent built on cryptologically-secure communications
  and a flexible architecture.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1548
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    - 4104
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000224'
