title: Encoded Powershell
id: TDL-EXE-000360
status: stable
description: Detects powershell with suspicious encoding options. Attackers frequently use base64 and
  similar encoding to evade detection. Investigate parent/child relationships to determine whether the
  activity is authorized.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1059
- detection.edp
- detection.execution
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    CommandLine|contains:
    - -EncodedCommand
    - '-enc '
    - '-e '
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000360'
