title: Allowed Exploit Attempt - Outbound
id: TDL-EXE-000090
status: stable
description: Detects when an outbound exploit is allowed by the intrusion detection security appliance.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1203
- detection.net
- detection.execution
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Allowed Exploit Attempt - Outbound
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: 000090
