title: PowerShell Remote Execution
id: TDL-EXE-000246
status: experimental
description: PowerShell can be used to execute commands on remote computers using WinRM over WMI. Attackers
  can use this as an alternative to PSEXEC tools to pivot and maintain access to compromised hosts. Alert
  will be sent in a weekly report only for the first 30 days from implementation.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1047
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: low
custom:
  v4_id: '000246'
