title: PowerShell Version Downgrade Activity
id: TDL-EXE-000522
status: experimental
description: Detects when a version lower than PowerShell 5.0 is used when running PowerShell.  Older
  versions of PowerShell have limited logging and security protections. A user running an older version
  of PowerShell is suspicious and might be malicious.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 4104
    - 41031
    - 4103
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000522'
