title: Ransomware Activity
id: TDL-EXE-000367
status: stable
description: Detects and O365 alert with the type Ransomware Activity
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1486
- detection.net
- detection.execution
logsource:
  service: office365
  product: m365
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: high
custom:
  v4_id: '000367'
