title: UtilityFunctions Script Usage Detected
id: TDL-EXE-000524
status: experimental
description: Detects the use of UtilityFunctions.ps1 within a PowerShel Script or command to execute a
  managed DLL. Derived from a Sigma rule created by "frack113".
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.execution
- attack.t1204
- detection.edp
- detection.execution
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 41041
    - 4104
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000524'
