title: Beaconing Detected - Periodic Outbound Connection
id: TDL-C2-001
status: stable
description: ''
references: []
author: TDL
date: '2024-02-15'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1071_001
- detection.beaconing
- detection.c2
- detection.cobalt-strike
logsource:
  category: firewall
detection:
  selection:
    Initiated: 'true'
    DestinationPort|contains|any:
    - '80'
    - '443'
    - '8080'
    - '8443'
  condition: selection
falsepositives:
- Software update clients
- NTP clients
- Monitoring agents
level: high
