title: EC2 Suspicious Outbound Communication
id: TDL-C2-000101
status: experimental
description: Detects when there is traffic from a EC2 to an external host labeled as malicious by GuardDuty.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1071
- detection.thr
- detection.command-and-control
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - EC2 Suspicious Outbound Communication
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: high
custom:
  v4_id: '000101'
