title: AWS Network Activity from Threat Host - GuardDuty
id: TDL-C2-000330
status: stable
description: Detects when network activity from a known threat is seen within AWS instance
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1071
- detection.thr
- detection.command-and-control
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS Network Activity from Threat Host - GuardDuty
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: medium
custom:
  v4_id: '000330'
