title: New Webserver Scripts
id: TDL-C2-000233
status: stable
description: Detects a web request to a script file that has not been requested before. New script files
  could be a web shell that was recently uploaded by an attacker. This building block will add the new
  script file names to a list to record them as observed and will be used for further correlation.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1078
- detection.net
- detection.command-and-control
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - New Webserver Scripts
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000233'
