title: First Seen Exploit from External Host
id: TDL-C2-000489
status: experimental
description: A rule that detects when a new exploit signature is seen sourcing from an external host
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1078
- detection.net
- detection.command-and-control
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - First Seen Exploit from External Host
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: 000489
