title: IRC Traffic - Outbound
id: TDL-C2-000054
status: stable
description: Designed to detect IRC traffic that could be indicative of C2 communication. IRC is a protocol
  that has been commonly known to be used in C2 communication.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1071
- detection.net
- detection.command-and-control
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 6667
    - 6668
    - 6669
    - 6697
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000054'
