title: APT User Agent
id: TDL-C2-000430
status: experimental
description: Detects suspicious user agent strings used in APT malware in proxy logs
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1071
- detection.net
- detection.command-and-control
logsource:
  category: proxy
detection:
  selection:
    EventID:
    - 50727
    - 4322
    - 4506
    - 30729
    - 2018
    - 1500
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000430'
