title: Allowed Command Injection Signature Detection - Inbound
id: TDL-C2-000469
status: experimental
description: Detects when inbound traffic with a Command Injection signature is allowed
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.command-and-control
- attack.t1078
- detection.net
- detection.command-and-control
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Allowed Command Injection Signature Detection - Inbound
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: 000469
