rule_id: TDL-DIS-000325
v4_id: '000325'
name: Excessive Failures by User - GCP
description: Detects when a Non-Service account fails more 10 actions within five minutes. This activity could be indicative
  of a threat actor testing what permissions an account has.
tactic: Discovery
tactic_id: TA0007
technique_id: T1078
technique_name: Valid Accounts
platform:
- GCP
data_sources:
- GCP
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: |-
    index=windows
    | bucket _time span=5m
    | stats count by src_ip, Account_Name, _time
    | where count >= 10
    | table _time, host, Account_Name, IpAddress, LogonType
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)
    | where Count >= 10
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_dis_000325 {
      meta:
        author = "TDL"
        description = "Excessive Failures by User - GCP"
        severity = "LOW"
        tactic = "TA0007"
        technique = "T1078"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 10

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 10
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 10)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 10
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 10\n| fields hostname, actor_effective_username,\
    \ event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- discovery
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  10 Cloud Audit event within 5 minutes
  Where code is 7 and not src_user gserviceaccount
suppression:
  window: 24 hours
tuning_period: 7 days
