rule_id: TDL-DIS-000636
v4_id: '000636'
name: LDAP ACL Recon - Defender
description: This detection identifies LDAP search activity that targets access control related attributes in AD. Specifically
  queries for nTSecurityDescriptor, AdminSDHolder, privileged groups, organizational units, and other objects that inherit
  security permissions
tactic: Discovery
tactic_id: TA0007
technique_id: T1069
technique_name: Permission Groups Discovery
platform:
- Windows
data_sources:
- Microsoft Defender
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_dis_000636 {\n  meta:\n    author = \"TDL\"\n    description = \"LDAP ACL Recon - Defender\"\n    severity\
    \ = \"LOW\"\n    tactic = \"TA0007\"\n    technique = \"T1069\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 5m\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*endpoint/edr*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1069*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: Tune per environment baseline.
tags:
- edp
- discovery
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 AdvancedHunting Device Event\nWhere event_category = \"AdvancedHunting-DeviceEvents\"\nWhere event_type =\
  \ \"LdapSearch\"\nWhere tags != \"[ ]\"\nWhere scope != \"Base\"\n\nWhere (\n    additional_fields contains \"DC=,DC=\"\n\
  \    OR additional_fields contains \"CN=AdminSDHolder\"\n)\n\nAND\nWhere additional_fields contains \"nTSecurityDescriptor\""
