rule_id: TDL-DIS-000639
v4_id: 000639
name: LDAP System Recon - Defender
description: Detects LDAP search activity that targets system-level objects, domain configuration data, and core directory
  infrastructure within Active Directory.
tactic: Discovery
tactic_id: TA0007
technique_id: T1018
technique_name: Remote System Discovery
platform:
- Windows
data_sources:
- Microsoft Defender
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: |-
    index=windows
    | where EventCode=8192
    | table _time, host, user, ProcessName, CommandLine
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID == 8192
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_dis_000639 {
      meta:
        author = "TDE"
        description = "LDAP System Recon - Defender"
        severity = "LOW"
        tactic = "TA0007"
        technique = "T1018"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: Tune per environment baseline.
tags:
- edp
- discovery
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: |-
  1 AdvancedHunting Device Event
  Where event_category = "AdvancedHunting-DeviceEvents"
  Where event_type = "LdapSearch"
  Where tags != "[ ]"
  Where scope!="Base"

  Where (
      additional_fields contains "(sAMAccountType=805306369)"
      OR additional_fields contains "(objectCategory=Computer)"
      OR additional_fields contains "(objectCategory=nTDSDSA)"
      OR additional_fields contains "(objectCategory=server)"
      OR additional_fields contains "(objectClass=computer)"
      OR additional_fields contains "(objectClass=server)"
      OR additional_fields contains "(primaryGroupID=521)"
      OR additional_fields contains "(primaryGroupID=516)"
      OR additional_fields contains "(primaryGroupID=515)"
      OR (
          Where additional_fields contains "(userAccountControl:1.2.840.113556.1.4.803:=8192)"
          OR Where additional_fields contains "ms-MCS-AdmPwd"
      )
  )

  AND
  Where (
      additional_fields does NOT contain "(domainSid=)"
      AND additional_fields does NOT contain "(objectSid=)"
  )
