title: AWS Runtime Process Injection Activity - GuardDuty
id: TDL-DE-000388
status: stable
description: Detects process injection activity within AWS
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1078
- detection.edp
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS Runtime Process Injection Activity - GuardDuty
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000388
