title: Configuration Change by Unauthorized User
id: TDL-DE-000123
status: stable
description: Detects when an unauthorized configuration change is made on a network or security appliance.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1562
- detection.auth
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Configuration Change by Unauthorized User
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000123'
