title: Azure Event Hub Deleted
id: TDL-DE-000390
status: stable
description: Detects Azure Event Hub deletions. Event Hubs are the primary method for logs to be forwarded
  to a destination outside of Azure (such as a SIEM) and as such, deleting an Event Hub may compromise
  monitoring.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1489
- detection.auth
- detection.defense-evasion
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Azure Event Hub Deleted
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000390
