title: Code Compiling - HVT
id: TDL-DE-000119
status: experimental
description: Detects an account using a compiler on a machine. Attackers can download or develop source
  code on a host to bypass detection of executable files and then compile it locally on the host to avoid
  detection.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1027
- detection.edp
- detection.defense-evasion
logsource:
  service: syslog
  product: linux
detection:
  selection:
    EventID:
    - 46881
    - 4688
  condition: selection
falsepositives:
- 'Old Regex for the command line: \b(gcc|g\+\+|cc|c\+\+|javac)\b


  ----------------------------------------------------------------


  New Regex matches on'
level: high
custom:
  v4_id: 000119
