title: TLS Downgrade
id: TDL-DE-000291
status: stable
description: An attacker tries a downgrade attack by modifying the Azure application configuration for
  TLS 1.3
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1562
- detection.auth
- detection.defense-evasion
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - TLS Downgrade
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000291
