title: Windows Event Log Cleared
id: TDL-DE-001
status: stable
description: ''
references: []
author: TDL
date: '2024-01-25'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1070_001
- detection.log-clearing
- detection.anti-forensics
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 1102
  condition: selection
falsepositives:
- Authorized IT staff during maintenance
level: critical
