title: Potential Credential Compromise - GuardDuty
id: TDL-DE-000668
status: experimental
description: This detection looks for a sequence of suspicious actions made by using AWS credentials that
  impacts one or more resources in your environment. Multiple suspicious and anomalous attack behaviors
  were observed by the same credentials, resulting in higher confidence that the credentials are being
  misused.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1586
- detection.edp
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - Potential Credential Compromise - GuardDuty
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: 000668
