title: Credentials Stored in Plaintext
id: TDL-DE-000225
status: experimental
description: The attacker would modify key systems to store plaintext credentials in memory. This can
  be modified in the Wdigest registry key.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1112
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46571
    - 4657
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000225'
