title: Web Request to Typosquatting Domain
id: TDL-DE-000463
status: experimental
description: Detects a web request to a company typosquatting domain
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1583
- detection.net
- detection.defense-evasion
logsource:
  category: proxy
detection:
  selection:
    Keywords:
    - Web Request to Typosquatting Domain
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: medium
custom:
  v4_id: '000463'
