title: File Encryption from Unsigned Process
id: TDL-DE-000217
status: experimental
description: Detects when an unsigned process executes an encryption process. Attackers or malicious processes
  may attempt to encrypt data on an infected host to either disguise data for exfiltration or damage the
  host by restricting access to core files, as used in ransomware.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1036
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000217'
