title: Kubernetes Events Deleted
id: TDL-DE-000581
status: experimental
description: 'Detects when events are deleted in Kubernetes. An adversary may delete Kubernetes events
  in an attempt to evade detection. Sigma rule by Leo Tsaousis (@laripping)


  ref: https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Delete%20K8S%20events/'
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1070
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Kubernetes Events Deleted
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000581
