title: AWS Encryption Protection Disabled
id: TDL-DE-000135
status: stable
description: Detects when an AWS customer master key (CMK) is disabled or scheduled to be deleted. CMK’s
  are used to encrypt the data encryption keys which are used to encrypt customer data. If the CMK is
  deleted or disabled, the data encryption keys are stored in plaintext and vulnerable to compromise if
  an attacker were to gain access.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1600
- detection.auth
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: '000135'
