title: Suspicious Certutil Usage
id: TDL-DE-000173
status: experimental
description: Detects the usage of Microsoft's certutil execution with sub commands like 'decode' or 'url'
  or 'ping', which could indicate an attacker attempting to decode malicious code with built-in tools
  on the host.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1140
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4688
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000173'
