title: EC2 Snapshot Sharing
id: TDL-DE-000161
status: stable
description: Detects the sharing of a snapshot with another account or if the snapshot has been made public.
  An unauthorized user could potentially be given access to all of the data within the snapshot.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1578
- detection.auth
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - EC2 Snapshot Sharing
  condition: selection
falsepositives:
- 'Reviewing logic - High false positive rate.

  Exclude expected user/ip pairs

  https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-s'
level: medium
custom:
  v4_id: '000161'
