title: Google Workspace Password Policy Modified
id: TDL-DE-000304
status: stable
description: Detects when a Google Workspace password policy is modified. An adversary may attempt to
  modify a password policy in order to weaken an organization’s security controls.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1484
- detection.auth
- detection.defense-evasion
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Google Workspace Password Policy Modified
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000304'
