title: AWS GuardDuty Trusted IP Set Created
id: TDL-DE-000426
status: experimental
description: Detects updates to the GuardDuty list of trusted IPs. An attacker can evade detection excluding
  an IP where GuardDuty doesn't generate findings for IP addresses that are included in IPSets.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1562
- detection.auth
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS GuardDuty Trusted IP Set Created
  condition: selection
falsepositives:
- 'https://docs.aws.amazon.com/guardduty/latest/APIReference/API_CreateIPSet.html

  https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde'
level: medium
custom:
  v4_id: '000426'
