title: Potential Pass the Hash Attack Activity
id: TDL-DE-000257
status: experimental
description: Pass the Hash (PTH) is commonly found when an attacker is dumping a connected user's password
  hash via NTLM from memory. The hash is passed to the remote host as a NTLM authentication instead of
  requesting a service ticket from the domain controller using Kerberos.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1550
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46241
    - 4624
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: low
custom:
  v4_id: '000257'
