title: Process Injection via CreateRemoteThread
id: TDL-DE-002
status: stable
description: ''
references: []
author: TDL
date: '2024-01-26'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1055_001
- detection.process-injection
- detection.defense-evasion
logsource:
  category: create_remote_thread
  product: windows
detection:
  selection:
    Keywords:
    - Process Injection via CreateRemoteThread
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Debugging tools
- AV/EDR products
level: high
