title: Cobalt Strike DLL Loaded with StartW Function
id: TDL-DE-000251
status: stable
description: Detects Cobalt Strike leveraging Rundll32 to call the StartW export function and load DLLs
  from the command line. Investigate the parent/child relationships and surrounding system activity of
  the RunDLL32.exe process in question.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1218
- detection.edp
- detection.defense-evasion
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000251'
