title: AWS GuardDuty Medium Alert
id: TDL-DE-000617
status: experimental
description: A catch all detection used to alert on any medium severity GuardDuty alert that is not mapped
  to an exisiting TDE Detection
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.defense-evasion
- attack.t1078
- detection.edp
- detection.defense-evasion
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS GuardDuty Medium Alert
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000617'
