title: File Transfer to Threat Host
id: TDL-EXF-000164
status: stable
description: This rule is designed to detect a host communicating over common data transfer ports to a
  domain or IP found on a Threat Intelligence Feed.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.exfiltration
- attack.t1071
- detection.thr
- detection.exfiltration
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - File Transfer to Threat Host
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: critical
custom:
  v4_id: '000164'
