title: Potential Data Exfiltration
id: TDL-EXF-000053
status: experimental
description: Detects a host communicating to an external host over common data transfer port with at least
  5 MB out.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.exfiltration
- attack.t1030
- detection.net
- detection.exfiltration
logsource:
  category: firewall
detection:
  selection:
    Keywords:
    - Potential Data Exfiltration
  condition: selection
falsepositives:
- It is best practice to use specific hosts for these file transfers which can be whitelisted from triggering
  the alarm.
level: low
custom:
  v4_id: '000053'
