title: Exfiltration to Newly Registered Domain
id: TDL-EXF-002
status: stable
description: ''
references: []
author: TDL
date: '2024-03-16'
modified: '2026-04-27'
tags:
- attack.exfiltration
- attack.t1048_002
- detection.exfiltration
- detection.new-domain
- detection.threat-intel
logsource:
  category: proxy
detection:
  selection:
    Keywords:
    - Exfiltration to Newly Registered Domain
  condition: selection
falsepositives:
- Legitimate vendors on new domains
- CDN edge nodes
level: high
