title: Malicious Traffic over Exfiltration Port - Inbound
id: TDL-EXF-000629
status: experimental
description: Detects a successful inbound connection identified on a threat feed using applications FTP,
  SSH, RDP, SMB, and Telnet.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.exfiltration
- attack.t1071
- detection.thr
- detection.exfiltration
logsource:
  category: firewall
detection:
  selection:
    EventID:
    - 3389
  condition: selection
falsepositives:
- Authorized pen testing
- Security research
level: medium
custom:
  v4_id: 000629
