title: AWS DNS Exfiltration Attempt - GuardDuty
id: TDL-EXF-000342
status: stable
description: Detects when an EC2 instance is running malware that uses DNS queries for outbound data transfers.
  This type of data transfer is indicative of a compromised instance and could result in the exfiltration
  of data.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.exfiltration
- attack.t1048
- detection.net
- detection.exfiltration
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS DNS Exfiltration Attempt - GuardDuty
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000342'
