rule_id: TDL-COL-000538
v4_id: 000538
name: Mass Repositories Cloned by User
description: Detect when a user attempts to clone multyiple repos. This may be an attempt to exfil sensitive company data.
tactic: Collection
tactic_id: TA0009
technique_id: T1213
technique_name: Data from Information Repositories
platform:
- Windows
data_sources:
- Github
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: |-
    index=windows
    | bucket _time span=5m
    | stats count by src_ip, Account_Name, _time
    | where count >= 5
    | table _time, src_ip, dest_ip, dest_port, action
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)
    | where Count >= 5
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_col_000538 {
      meta:
        author = "TDL"
        description = "Mass Repositories Cloned by User"
        severity = "LOW"
        tactic = "TA0009"
        technique = "T1213"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 5

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 5
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 5)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 5
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 5\n| fields hostname, actor_effective_username,\
    \ event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- collection
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "5 Github event\n   where actions is \"git.clone\""
