rule_id: TDL-COL-000413
v4_id: '000413'
name: Unauthorized Report Exported - Salesforce
description: Detects when a report is exported by an unauthorized user. Reports contain a variety of information that adversaries
  may attempt to exfiltrate.
tactic: Collection
tactic_id: TA0009
technique_id: T1213
technique_name: Data from Information Repositories
platform:
- Windows
data_sources:
- Salesforce
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=windows

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_col_000413 {\n  meta:\n    author = \"TDL\"\n    description = \"Unauthorized Report Exported - Salesforce\"\
    \n    severity = \"LOW\"\n    tactic = \"TA0009\"\n    technique = \"T1213\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1213*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- collection
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: "1 Salseforce Event  \nWhere the Event Type is 'ReportExport'\nWhere the Source Username is NOT on the Salesforce\
  \ Admins List"
suppression:
  window: 24 Hours
tuning_period: 7 days
