rule_id: TDL-CA-000176
v4_id: '000176'
name: Password Reset Tracker
description: Detects recent password changes throughout the environment and adds the use to a list that is excluded from brute
  force attacks. Hosts and other devices maybe slow to update passwords and could generate false positives. The source IP
  and username is added to a tracker list.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1078
technique_name: Valid Accounts
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4724'
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4724 OR EventCode=4724)

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4724, 4724)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4724\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_ca_000176 {\n  meta:\n    author = \"TDL\"\n    description = \"Password Reset Tracker\"\n    severity\
    \ = \"MEDIUM\"\n    tactic = \"TA0006\"\n    technique = \"T1078\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4724\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4724'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4724])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4724

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4724)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4724)
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- credential-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Windows Password Reset Event

  Where the Event ID is in [628, 4724]'
tuning_period: 7 days
