rule_id: TDL-CA-000182
v4_id: 000182
name: Shadow File Accessed - HVT
description: Detects when the shadow file is accessed on a high value target host.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1003
technique_name: OS Credential Dumping
platform:
- Linux
data_sources:
- Linux Operating System
severity: Critical
fidelity: High
lifecycle: Deployed
risk_score: 95
queries:
  spl: 'index=linux

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'Syslog

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_ca_000182 {\n  meta:\n    author = \"TDL\"\n    description = \"Shadow File Accessed - HVT\"\n    severity\
    \ = \"CRITICAL\"\n    tactic = \"TA0006\"\n    technique = \"T1003\"\n\n  events:\n    $event.metadata.event_type = \"\
    GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host\
    \ over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-system.syslog*,logs-auditd*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*linux*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id IN ("11","23","26") AND _raw matches "*T1003*"

    | count by host, user, target_filename, image

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- credential-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Linux Command Line Event

  Where the Command contains [etc\shadow, shadow]

  Where the Destination Hostname is on the High Value Target Host List'
suppression:
  window: 4 Hours
tuning_period: 7 days
