rule_id: TDL-CA-000663
v4_id: '000663'
name: Windows Replay Attack Detected
description: This rule identifies potential replay attacks on Windows systems. Replay attacks involve capturing and reusing
  valid authentication tokens or network traffic to gain unauthorized access. This detection focuses on anomalies such as
  repeated Kerberos authentication errors (e.g., KRB_AP_ERR_REPEAT ) or unusual patterns in authentication attempts.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1558
technique_name: Steal or Forge Kerberos Tickets
platform:
- Windows
data_sources:
- Microsoft Windows
- 'Event IDs: 4649'
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: |-
    index=windows
    | where (EventCode=4649 OR EventCode=4649)
    | table _time, host, Account_Name, IpAddress, LogonType
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID in (4649, 4649)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE eventid = 4649
      AND INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC
  yara_l: |-
    rule zs_ca_000663 {
      meta:
        author = "TDL"
        description = "Windows Replay Attack Detected"
        severity = "HIGH"
        tactic = "TA0006"
        technique = "T1558"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.metadata.product_event_type = "4649"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | WHERE event.code IN ('4649')
    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT event_count DESC
  leql: |-
    where(event_id IN [4649])
    groupby(hostname, username)
    calculate(count AS event_count)
  crowdstrike: |-
    event_simpleName=SecurityEvent
    | where EventCode=4649
    | table ComputerName, UserName, CommandLine, ContextTimeStamp
  xql: |-
    dataset = xdr_data
    | filter event_type = "PROCESS" and action_evtlog_event_id in (4649)
    | filter _time > to_timestamp(now() - 86400, "epoch")
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time
    | sort desc _time
  lucene: event_id:(4649)
false_positives:
- Miss-configuration may casuse false positives. Base line for atleast a week.
tuning_guidance: Tune per environment baseline.
tags:
- auth
- credential-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: '1 Windows Security Event

  Where Event ID 4649'
