rule_id: TDL-CA-000143
v4_id: '000143'
name: DC Sync Attack
description: Detects an attacker performing a DCSync attack which involves taking advantage of the Directory Replication Service
  Remote (DRSR) protocol to obtain sensitive information from a DC such as password hashes for domain users. This is preformed
  by the attacker masquerading their host as a domain controller and tricking an authentic DC to synchromize its database
  to it.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1003
technique_name: OS Credential Dumping
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4662'
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4662 OR EventCode=4662 OR EventCode=3607)

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4662, 4662, 3607)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4662\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_ca_000143 {\n  meta:\n    author = \"TDE\"\n    description = \"DC Sync Attack\"\n    severity = \"MEDIUM\"\
    \n    tactic = \"TA0006\"\n    technique = \"T1003\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\n\
    \    $event.metadata.product_event_type = \"4662\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4662'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4662])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4662

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4662)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4662)
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- credential-access
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: '1 Windows Operation Performed on an Object Event

  Where the Event ID is in [566, 4662]

  Where the Source Username does NOT end with "$"

  Where the Source Username does NOT start with "msol_"

  Where the Source is not a Domain Controller

  Where the Properties contains one of the following: [“Replicating Directory Changes all”, “1131f6ad-9c07-11d1-f79f-00c04fc2dcd2”,
  “1131f6aa-9c07-11d1-f79f-00c04fc2dcd2”, “9923a32a-3607-11d2-b9be-0000f87a36b2”]'
suppression:
  window: 12 hours
  fields:
  - Source Hostname
tuning_period: 7 days
