rule_id: TDL-CA-000202
v4_id: '000202'
name: Credential Dumping
description: "Detects the dumping of memory or registry hives to gain credentials. The tool Procdump or Task Manager can be\
  \ used to dump the memory of the lsass.exe. The lsass process is responsible for the authentication of users on a Windows\
  \ host. Procdump is a tool that can dump a process\u2019 memory to a file. The Task Manager can also be used to dump any\
  \ process\u2019 memory in the GUI. By dumping the memory of lsass.exe, an attacker can search the memory for plaintext passwords\
  \ that were inputted during authentication and compromise the accounts. Alternatively, an attacker can use reg.exe to download\
  \ the Security Account Manager (SAM) registry hive, which contains user password hashes. These hashes can then be cracked\
  \ or used in pass-the-hash attacks at a later time."
tactic: Credential Access
tactic_id: TA0006
technique_id: T1003
technique_name: OS Credential Dumping
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688'
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=4688 OR EventCode=4657)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 4688, 4657)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid IN (4688, 4657)\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_ca_000202 {\n  meta:\n    author = \"TDL\"\n    description = \"Credential Dumping\"\n    severity = \"\
    HIGH\"\n    tactic = \"TA0006\"\n    technique = \"T1003\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'', ''4657'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688, 4657])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688 OR EventCode=4657

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688, 4657)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688 OR 4657)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id IN ("12","13","14") AND _raw matches "*T1003*"

    | count by host, user, registry_key, registry_value, image

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- credential-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Creation Event\nWhere the Event ID is in [592, 4688]\nWhere Destination Host is a Domain\
  \ Controller\nOR\n    Where Process Name equals \"reg.exe\"\n\tOR\n\t\tWhere Command Line contains \"save hklm\\system\"\
  \n\t\tWhere Command Line contains \"save hklm\\sam\"\n\t\tWhere Command Line contains \"save hklm\\security\"\n\t\tWhere\
  \ Command Line contains \"save hkey_local_machine\\system\"\n\t\tWhere Command Line contains \"save hkey_local_machine\\\
  sam\"\n\t\tWhere Command Line contains \"save hkey_local_machine\\security\"\n\t\tWhere Command Line contains \"save registry\\\
  machine\\system\"\n\t\tWhere Command Line contains \"save registry\\machine\\sam\"\n\t\tWhere Command Line contains \"save\
  \ registry\\machine\\security\"\n\t\tWhere Command Line contains \"export hklm\\system\"\n\t\tWhere Command Line contains\
  \ \"export hklm\\sam\"\n\t\tWhere Command Line contains \"export hklm\\security\"\n\t\tWhere Command Line contains \"export\
  \ hkey_local_machine\\system\"\n\t\tWhere Command Line contains \"export hkey_local_machine\\sam\"\n\t\tWhere Command Line\
  \ contains \"export hkey_local_machine\\security\"\n\t\tWhere Command Line contains \"export registry\\machine\\system\"\
  \n\t\tWhere Command Line contains \"export registry\\machine\\sam\"\n\t\tWhere Command Line contains \"export registry\\\
  machine\\security\"\n   \n    Where Process Name equals \"powershell.exe\"\n    Where Command Line contains \"Invoke-Mimikatz\"\
  \n\t\n\tWhere Process Name equals \"procdump.exe\"\n\tWhere Command contains \"lsass.exe\"\n\t\n\tWhere Process Name equals\
  \ \"taskmgr.exe\"\n\tWhere Command contains \"lsass\"\n\n\n-----------------------------------------------------------------------------------\n\
  \n1 Windows Process Creation Event\nWhere the Event ID is in [4657]\nWhere Destination Host is a Domain Controller\nRegistry\
  \ Key contains [hklm\\system, hklm\\sam, hkey_local_machine\\system, hklm\\security, hkey_local_machine\\sam, hkey_local_machine\\\
  security, registry\\machine\\system, registry\\machine\\sam, registry\\machine\\security]"
suppression:
  window: 8 hours
  fields:
  - Source Username
tuning_period: 7 days
