rule_id: TDL-CA-000163
v4_id: '000163'
name: Promiscuous Mode Enabled
description: This rule is designed to detect a network interface card entering promiscuous mode. Once a network interface
  card has been switched to promiscuous mode and encryption is not used, an attacker could see traffic from other hosts on
  the network.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1040
technique_name: Network Sniffing
platform:
- Linux
data_sources:
- Linux
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=linux

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'Syslog

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_ca_000163 {\n  meta:\n    author = \"TDL\"\n    description = \"Promiscuous Mode Enabled\"\n    severity\
    \ = \"HIGH\"\n    tactic = \"TA0006\"\n    technique = \"T1040\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 5m\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-system.syslog*,logs-auditd*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*linux*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1040*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- net
- credential-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: '1 Linux Audit Event

  Where the Event Type is "ANOM_PROMISCUOUS"

  where mode is "enabled"'
suppression:
  window: 8 hours
tuning_period: 7 days
