rule_id: TDL-CA-000193
v4_id: 000193
name: EC2 RDP Password Retrieval
description: Detects an attacker making a large number of API calls attempting to retrieve RDP passwords from an EC2 instance.
tactic: Credential Access
tactic_id: TA0006
technique_id: T1552
technique_name: Unsecured Credentials
platform:
- AWS
data_sources:
- AWS CloudTrail
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: |-
    index=aws sourcetype=aws:cloudtrail
    | bucket _time span=5m
    | stats count by src_ip, Account_Name, _time
    | where count >= 10
    | table _time, host, Account_Name, IpAddress, LogonType
  kql: |-
    AWSCloudTrail
    | where TimeGenerated >= ago(1d)
    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)
    | where Count >= 10
    | project TimeGenerated, Computer, Account, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_ca_000193 {
      meta:
        author = "TDE"
        description = "EC2 RDP Password Retrieval"
        severity = "LOW"
        tactic = "TA0006"
        technique = "T1552"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 10

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-aws.cloudtrail*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 10
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 10)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 10
    | sort -proc_count
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 10\n| fields hostname,\
    \ actor_effective_username, event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- credential-access
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  10 AWS CloudTrail Events
  Where the Event Name is in [GetPasswordData]
  From a single source and a single user
  Within 5 minutes
suppression:
  window: 24 hours
  fields:
  - src_ip
  - src_user
tuning_period: 7 days
