rule_id: TDL-IMP-000132
v4_id: '000132'
name: AWS Production Instance Terminations
description: Detects when multiple AWS production instances are terminated in a short amount of time. An attacker may terminate
  instances to destory data with the goal of negatively impacting the company’s operations.
tactic: Impact
tactic_id: TA0040
technique_id: T1489
technique_name: Service Stop
platform:
- AWS
data_sources:
- AWS CloudTrail
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 75
queries:
  spl: |-
    index=aws sourcetype=aws:cloudtrail
    | bucket _time span=5m
    | stats count by src_ip, Account_Name, _time
    | where count >= 3
    | table _time, host, user, ProcessName, CommandLine
  kql: |-
    AWSCloudTrail
    | where TimeGenerated >= ago(1d)
    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)
    | where Count >= 3
    | project TimeGenerated, Computer, Account, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_imp_000132 {
      meta:
        author = "TDE"
        description = "AWS Production Instance Terminations"
        severity = "HIGH"
        tactic = "TA0040"
        technique = "T1489"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 3

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-aws.cloudtrail*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 3
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 3)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 3
    | sort -proc_count
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 3\n| fields hostname,\
    \ actor_effective_username, event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- impact
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  3 AWS CloudTrail Events
  Where the EventName is in [TerminateInstances, DeleteInstance]
  Where the Instance is found in the AWS Production Instances List
  With the same Source Username
  Within 5 minutes
suppression:
  window: 8 hours
tuning_period: 7 days
