rule_id: TDL-DE-000661
v4_id: '000661'
name: Windows Active Directory Object WriteDAC Access
description: Detects instances where WriteDAC permissions are modified or accessed. WriteDAC allows users to change the discretionary
  access control list (DACL) of an object, which defines the permissions for that object. Unauthorized or unexpected changes
  to WriteDAC permissions can indicate potential privilege escalation or malicious activity.
tactic: Defense Evasion
tactic_id: TA0005
technique_id: T1222
technique_name: File and Directory Permissions Modification
platform:
- Windows
data_sources:
- Microsoft Windows
- 'Event IDs: 4662'
severity: Critical
fidelity: High
lifecycle: Proposed
risk_score: 95
queries:
  spl: 'index=windows

    | where (EventCode=4662 OR EventCode=4662)

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4662, 4662)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4662\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_de_000661 {\n  meta:\n    author = \"TDL\"\n    description = \"Windows Active Directory Object WriteDAC\
    \ Access\"\n    severity = \"CRITICAL\"\n    tactic = \"TA0005\"\n    technique = \"T1222\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.metadata.product_event_type = \"4662\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4662'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4662])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4662

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4662)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4662)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1222*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: Tune per environment baseline.
tags:
- auth
- defense-evasion
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Security Event \nWhere Event ID 4662\nWhere ObjectServer = \"DS\"\nWhere AccessMask = \"0x40000\"\
  \nOR\n    Where ObjectType contains \"19195a5b-6da0-11d0-afd3-00c04fd930c9\"\n\n    WhereObjectType contains \"domainDNS\""
