rule_id: TDL-DE-000247
v4_id: '000247'
name: Local Firewall Modified
description: Detects when the Windows Firewall is disabled or modified on a  host. Malware typically works to disable security
  features on hosts. While this method is typically considered noisy malicious activity, any tampering of the Windows Firewall
  service is considered an indicator of compromise on a machine.
tactic: Defense Evasion
tactic_id: TA0005
technique_id: T1562
technique_name: Impair Defenses
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 5025'
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: |-
    index=windows
    | where (EventCode=5025 OR EventCode=5025)
    | table _time, host, user, ProcessName, CommandLine
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID in (5025, 5025)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_de_000247 {
      meta:
        author = "TDL"
        description = "Local Firewall Modified"
        severity = "MEDIUM"
        tactic = "TA0005"
        technique = "T1562"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- defense-evasion
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: "1 Windows Firewall Service Stopped Event \nWhere the Event ID is 5025"
suppression:
  window: 12 hours
tuning_period: 7 days
