rule_id: TDL-DE-000217
v4_id: '000217'
name: File Encryption from Unsigned Process
description: Detects when an unsigned process executes an encryption process. Attackers or malicious processes may attempt
  to encrypt data on an infected host to either disguise data for exfiltration or damage the host by restricting access to
  core files, as used in ransomware.
tactic: Defense Evasion
tactic_id: TA0005
technique_id: T1036
technique_name: Masquerading
platform:
- Windows
data_sources:
- Windows Operating System
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_de_000217 {\n  meta:\n    author = \"TDL\"\n    description = \"File Encryption from Unsigned Process\"\
    \n    severity = \"MEDIUM\"\n    tactic = \"TA0005\"\n    technique = \"T1036\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id IN ("11","23","26") AND _raw matches "*T1036*"

    | count by host, user, target_filename, image

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- defense-evasion
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
suppression:
  window: 12 hours
tuning_period: 7 days
