rule_id: TDL-DE-000185
v4_id: 000185
name: Code Compiling
description: Detects an account using a compiler on a machine. Attackers can download or develop source code on a host to
  bypass detection of executable files and then compile it locally on the host to avoid detection.
tactic: Defense Evasion
tactic_id: TA0005
technique_id: T1027
technique_name: Obfuscated Files or Information
platform:
- Linux
- Windows
data_sources:
- Windows Operating System
- Linux Operating System
- 'Event IDs: 4688'
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: 'index=linux

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'Syslog

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_de_000185 {\n  meta:\n    author = \"TDL\"\n    description = \"Code Compiling\"\n    severity = \"LOW\"\
    \n    tactic = \"TA0005\"\n    technique = \"T1027\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\n\
    \    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-system.syslog*,logs-auditd*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1027*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- 'Old Regex for the command line: \b(gcc|g\+\+|cc|c\+\+|javac)\b


  ----------------------------------------------------------------


  New Regex matches on'
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- defense-evasion
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Execution Event \nWhere the Event ID is in [592, 4688]\nWhere the Destination Hostname is\
  \ NOT on a High Value Target Host List\nWhere the Command matches the regex \"(?:(?:^[\\\"\\s]{0,1}(gcc|g\\+\\+|cc|c\\+\\\
  +|javac)\\b)|(?:^(?:[\\\\\\/](?:\\w|\\\\\\s)*)+(gcc|g\\+\\+|cc|c\\+\\+|javac)\\b)|(?:\\|\\s*(gcc|g\\+\\+|cc|c\\+\\+|javac)\\\
  b)|(?:^[\\\"\\'][^\\\"]*[\\\\\\/](gcc|g\\+\\+|cc|c\\+\\+|javac)[\\\"\\']))\"\n\n---------------------------------------------------------------------------------------------------------------\n\
  \n1 Linux Command Line Event\nWhere the Destination Hostname is NOT on a High Value Target Host List\nWhere the Command\
  \ matches the regex \"(?:(?:^[\\\"\\s]{0,1}(gcc|g\\+\\+|cc|c\\+\\+|javac)\\b)|(?:^(?:[\\\\\\/](?:\\w|\\\\\\s)*)+(gcc|g\\\
  +\\+|cc|c\\+\\+|javac)\\b)|(?:\\|\\s*(gcc|g\\+\\+|cc|c\\+\\+|javac)\\b)|(?:^[\\\"\\'][^\\\"]*[\\\\\\/](gcc|g\\+\\+|cc|c\\\
  +\\+|javac)[\\\"\\']))\""
suppression:
  window: 24 hours
  fields:
  - Source Username
tuning_period: 7 days
