rule_id: TDL-PER-000229
v4_id: 000229
name: Startup File Modification - OSX
description: Detects when files related to configuring startup processes are modified in OSX. Attackers can create malicious
  plist files and place them in the LaunchAgent and LaunchDaemon directories, or modify the rc.common or launchd.conf files
  to configure the malicious process to run on the machines startup process to establish persistence.
tactic: Persistence
tactic_id: TA0003
technique_id: T1037
technique_name: Boot or Logon Initialization Scripts
platform:
- macOS
data_sources:
- MAC Operating System
- 'Event IDs: 4663'
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | where (EventCode=4663 OR EventCode=4663)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4663, 4663)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4663\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_per_000229 {\n  meta:\n    author = \"TDL\"\n    description = \"Startup File Modification - OSX\"\n  \
    \  severity = \"HIGH\"\n    tactic = \"TA0003\"\n    technique = \"T1037\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.metadata.product_event_type = \"4663\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4663'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4663])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4663

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4663)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4663)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- persistence
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: '1 Windows Modification Event

  Where the Windows Event ID is in [567, 4663]

  Where the File Name is in [Library/LaunchDaemons/, Library/LaunchAgents/, etc/rc.common, etc/launchd.conf]

  Where the Process Name is NOT in [installd, shove, mdworker, mds, backup]'
suppression:
  window: 8 hours
tuning_period: 7 days
