rule_id: TDL-PER-002
name: New Service Created with Suspicious Executable Path
tactic: Persistence
tactic_id: TA0003
technique_id: T1543.003
technique_name: Windows Service
platform:
- Windows
data_sources:
- Windows Security Event Log (7045)
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 80
queries:
  spl: 'index=windows sourcetype=WinEventLog:System EventCode=7045

    | where match(ServiceFileName, "(?i)(\\temp\\|\\appdata\\|\\public\\")

    | table _time, host, AccountName, ServiceName, ServiceFileName'
  kql: 'DeviceEvents

    | where TimeGenerated >= ago(1d)

    | where ActionType == "ServiceInstalled"

    | where AdditionalFields matches regex @"(?i)(\\temp\\|\\appdata\\|\\public\\)"

    | project TimeGenerated, DeviceName, InitiatingProcessAccountName, AdditionalFields'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 7045\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule tdl_per_002 {\n  meta:\n    author = \"TDL\"\n    description = \"New Service Created with Suspicious Executable\
    \ Path\"\n    severity = \"HIGH\"\n    tactic = \"TA0003\"\n    technique = \"T1543.003\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.metadata.product_event_type = \"7045\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''7045'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [7045])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=7045

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (7045)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(7045)
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1543.003*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Some legitimate software in non-standard paths
tags:
- service
- persistence
author: TDL
created: '2024-01-20'
test_method: purple_team
last_modified: '2026-04-27'
