rule_id: TDL-PER-000227
v4_id: '000227'
name: WinSxS DLL Side-Loading
description: Detects DLL being modified in the WinSxS directories. WinSxS (Windows Side-by-Side) is a repository of older
  versions of DLL files that Windows maintains for backwards-compatibility. If an older application is run, Windows will load
  the older DLLs that correspond to that version instead of the current DLL. Attackers can identify which older DLLs are being
  loaded and replace them with malicious DLLs so they will be loaded by the OS which could lead to a system foothold.
tactic: Persistence
tactic_id: TA0003
technique_id: T1574
technique_name: Hijack Execution Flow
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688'
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=4688)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 4688)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_per_000227 {\n  meta:\n    author = \"TDE\"\n    description = \"WinSxS DLL Side-Loading\"\n    severity\
    \ = \"MEDIUM\"\n    tactic = \"TA0003\"\n    technique = \"T1574\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- persistence
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Execution Event \nWhere the Event ID is in [592, 4688]\nWhere the Process Name is rundll32.exe\n\
  Where command contains \" C:\\Windows\\winsxs\"\n\n---------------------------------------------------------------------------------------------------------------\n\
  \n1 Windows Sysmon Event\nWhere the Event ID is 7\nWhere the Image Loaded contains \" C:\\Windows\\winsxs\"\nWhere the Image\
  \ Loaded ends with \".dll\""
suppression:
  window: 12 hours
tuning_period: 7 days
