rule_id: TDL-PER-000662
v4_id: '000662'
name: Hidden Account Creation
description: This rule monitors for the creation of user accounts with names ending in a dollar sign ($), which typically
  indicates a machine account. While such accounts are standard in Active Directory environments for computer objects, the
  unauthorized creation of accounts with this naming pattern could signify malicious activity, such as attempts to blend in
  as legitimate machine accounts to evade detection.
tactic: Persistence
tactic_id: TA0003
technique_id: T1136
technique_name: Create Account
platform:
- Windows
data_sources:
- Microsoft Windows
- 'Event IDs: 4720'
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4720 OR EventCode=4720)

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4720, 4720)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4720\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_per_000662 {\n  meta:\n    author = \"TDL\"\n    description = \"Hidden Account Creation\"\n    severity\
    \ = \"MEDIUM\"\n    tactic = \"TA0003\"\n    technique = \"T1136\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4720\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4720'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4720])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4720

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4720)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4720)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1136*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: Tune per environment baseline.
tags:
- auth
- persistence
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: '1 Windows Security Event

  Where Event ID 4720

  Where TargetUserName ends with "$"'
