rule_id: TDL-PER-000369
v4_id: 000369
name: Azure Successful Powershell Login
description: Detects a successful Azure login via Azure Powershell.
tactic: Persistence
tactic_id: TA0003
technique_id: T1098
technique_name: Account Manipulation
platform:
- Azure
data_sources:
- Azure
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=azure

    | table _time, host, Account_Name, IpAddress, LogonType'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID == 1685

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_per_000369 {\n  meta:\n    author = \"TDL\"\n    description = \"Azure Successful Powershell Login\"\n\
    \    severity = \"LOW\"\n    tactic = \"TA0003\"\n    technique = \"T1098\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-azure*,logs-o365*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort\
    \ desc _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*azure*

    | parse regex "\"userIdentity\":\{\"arn\":\"(?<actor>[^\"]+)" nodrop

    | where _raw matches "*T1098*"

    | count by actor, eventName, sourceIPAddress

    | sort by _count desc'
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 14 days.'
tags:
- auth
- persistence
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Azure SigninLogs Event

  Where OperationName is in [Sign-in activity]

  Where the Application ID is in [1b730954-1685-4b74-9bfd-dac224a7b894]

  Where the Token Issuer Type is in [AzureAD]

  Where Action is in [Success]'
suppression:
  window: 24 hours
  fields:
  - src_user
tuning_period: 14 days
