rule_id: TDL-PER-002
name: New Service Created with Suspicious Executable Path
tactic: Persistence
tactic_id: TA0003
technique_id: T1543.003
technique_name: Windows Service
platform:
- Windows
data_sources:
- Windows Security Event Log (7045)
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 80
queries:
  spl: 'index=windows sourcetype=WinEventLog:System EventCode=7045

    | where match(ServiceFileName, "(?i)(\\temp\\|\\appdata\\|\\public\\")

    | table _time, host, AccountName, ServiceName, ServiceFileName'
  kql: 'DeviceEvents

    | where TimeGenerated >= ago(1d)

    | where ActionType == "ServiceInstalled"

    | where AdditionalFields matches regex @"(?i)(\\temp\\|\\appdata\\|\\public\\)"

    | project TimeGenerated, DeviceName, InitiatingProcessAccountName, AdditionalFields'
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE eventid = 7045
      AND INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC
  yara_l: |-
    rule tdl_per_002 {
      meta:
        author = "TDL"
        description = "New Service Created with Suspicious Executable Path"
        severity = "HIGH"
        tactic = "TA0003"
        technique = "T1543.003"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.metadata.product_event_type = "7045"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | WHERE event.code IN ('7045')
    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT event_count DESC
  leql: |-
    where(event_id IN [7045])
    groupby(hostname, username)
    calculate(count AS event_count)
  crowdstrike: |-
    event_simpleName=SecurityEvent
    | where EventCode=7045
    | table ComputerName, UserName, CommandLine, ContextTimeStamp
  xql: |-
    dataset = xdr_data
    | filter event_type = "PROCESS" and action_evtlog_event_id in (7045)
    | filter _time > to_timestamp(now() - 86400, "epoch")
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time
    | sort desc _time
  lucene: |-
    event_id:(7045)
false_positives:
- Some legitimate software in non-standard paths
tags:
- service
- persistence
author: TDL
created: '2024-01-20'
test_method: purple_team
last_modified: '2026-04-27'
