rule_id: TDL-PER-000646
v4_id: '000646'
name: Ransomware Remnants Discovered - Varonis
description: Detects remnants of ransomware identified on a host or backup image.
tactic: Persistence
tactic_id: TA0003
technique_id: T1547
technique_name: Boot or Logon Autostart Execution
platform:
- Windows
data_sources:
- Varonis
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_per_000646 {
      meta:
        author = "TDL"
        description = "Ransomware Remnants Discovered - Varonis"
        severity = "MEDIUM"
        tactic = "TA0003"
        technique = "T1547"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=BootstrapProcess OR event_simpleName=SuspiciousFilesWithOperation
    | where FileOperation IN ("WRITE","RENAME","DELETE")
    | stats count(FileName) as file_count, dc(FileExtension) as ext_count by ComputerName, FileName_parent
    | where file_count >= 50 AND ext_count >= 3
    | sort -file_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: |-
    source_name:Microsoft-Windows-Sysmon AND event_id:11
    AND NOT file_extension:(tmp OR log OR ini)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: Tune per environment baseline.
tags:
- edp
- persistence
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  1 Varonis DatAdvantage Alert
  Where the Alert Name is in ["Old ransomware note was found in the system","Past ransomware activity indicated by a residual ransomware note"]
