rule_id: TDL-AUTH-000534
v4_id: '000534'
name: Server-Side Code Injection in URL
description: Attackers may use improper URL checking to inject code that is executed on a server.  This may be used in DoS
  attacks or to execute commands to elevate privilege.  The attack pattern is similar to Shellshock exploitation.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1190
technique_name: Exploit Public-Facing Application
platform:
- AWS
data_sources:
- AWS ELB
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: 'index=aws sourcetype=aws:cloudtrail

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'AWSCloudTrail

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_auth_000534 {\n  meta:\n    author = \"TDL\"\n    description = \"Server-Side Code Injection in URL\"\n\
    \    severity = \"LOW\"\n    tactic = \"TA0001\"\n    technique = \"T1190\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-aws.cloudtrail*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort\
    \ desc _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*aws*

    | parse regex "\"userIdentity\":\{\"arn\":\"(?<actor>[^\"]+)" nodrop

    | where _raw matches "*T1190*"

    | count by actor, eventName, sourceIPAddress

    | sort by _count desc'
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- initial-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
