rule_id: TDL-AUTH-000539
v4_id: 000539
name: Dependabot Disabled
description: Detecs when Depndabot has been disabled. Dependabot inform users about vulnerabilities and pulls down patches
  to patch vulneraboiliies in code. A threat actor may disable this to prevent vulnerablilites from being patched.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1195
technique_name: Supply Chain Compromise
platform:
- Windows
data_sources:
- Github
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_auth_000539 {
      meta:
        author = "TDE"
        description = "Dependabot Disabled"
        severity = "HIGH"
        tactic = "TA0001"
        technique = "T1195"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- initial-access
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: |-
  1 Github event
     where actions IN (dependabot_alerts.disable, repository_vulnerability_alerts.disable, dependabot_security_updates.disable, dependabot_security_updates_new_repos.disable)
