rule_id: TDL-AUTH-000175
v4_id: '000175'
name: Possible RDP Hijacking
description: Detects if the tscon server process is running as the local system account. If attackers are able to gain command
  execution with NT\System then they can hijack any currently logged in user's RDP session, without any knowledge about their
  credentials.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1563
technique_name: Remote Service Session Hijacking
platform:
- Windows
data_sources:
- Windows Operating System
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | where EventCode=4688

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID == 4688

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_auth_000175 {\n  meta:\n    author = \"TDL\"\n    description = \"Possible RDP Hijacking\"\n    severity\
    \ = \"MEDIUM\"\n    tactic = \"TA0001\"\n    technique = \"T1563\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- initial-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Execution Event \nWhere the Event ID is in [592, 4688]\nOR\n\tWhere the process is tscon.exe\n\
  \t\n\tWhere Command contains \"cmd.exe\"\n               Where Command contains \"tscon\"\n\tOR\n\t\tWhere the Command contains\
  \ \"/k\"\n\t\t\n\t\tWhere the Command contains \"/c\"\n\nOR \n\tWhere Command contains \"tscon\"\n        Where Command\
  \ contains \"dest:rdp-\""
suppression:
  window: 12 hours
  fields:
  - Source Username
tuning_period: 7 days
