rule_id: TDL-AUTH-000082
v4_id: 000082
name: Exploit Attempt Followed by Malware Detection
description: Detects a scenario where an exploit is detected targeting a host followed by a malware detection on that same
  host. This could indicate a succesful exploit against the target host.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1190
technique_name: Exploit Public-Facing Application
platform:
- Network
data_sources:
- Antivirus
- IDS/IPS
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT sourceip, destinationip, destinationport, SUM(flowCount) AS total_flows

    FROM flows

    WHERE INOFFSET(starttime, LAST 900 SECONDS)

    GROUP BY sourceip, destinationip, destinationport

    ORDER BY starttime DESC'
  yara_l: "rule zs_auth_000082 {\n  meta:\n    author = \"TDL\"\n    description = \"Exploit Attempt Followed by Malware Detection\"\
    \n    severity = \"MEDIUM\"\n    tactic = \"TA0001\"\n    technique = \"T1190\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 15m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-network*,logs-firewall*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 15m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"NETWORK\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- initial-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 IDS/IPS Exploit Event

  From an external source to an internal destination (Inbound)


  Followed By


  1 Malware Detection Event

  Where the Source IP is equal to the Destination IP in the previous event

  Within 15 minutes'
suppression:
  window: 12 hours
tuning_period: 7 days
