rule_id: TDL-AUTH-000146
v4_id: '000146'
name: IDS Web Shell Detected
description: Detects when a web server is sending or receiving traffic that is flagged by the IDS as web shell traffic. After
  an attacker exploits a web server, they may upload malicious scripts for a web-based backdoor that gives them full access
  to the server.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1505
technique_name: Server Software Component
platform:
- Network
data_sources:
- IDS/IPS
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=windows

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT sourceip, destinationip, destinationport, SUM(flowCount) AS total_flows

    FROM flows

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY sourceip, destinationip, destinationport

    ORDER BY starttime DESC'
  yara_l: "rule zs_auth_000146 {\n  meta:\n    author = \"TDL\"\n    description = \"IDS Web Shell Detected\"\n    severity\
    \ = \"LOW\"\n    tactic = \"TA0001\"\n    technique = \"T1505\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 5m\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-network*,logs-firewall*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"NETWORK\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- net
- initial-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 IDS/IPS Exploit Event

  From an external source to an internal destination (Inbound)

  Where the Siganture contains case insensitive "shell"

  Where the signature does NOT contain case insensitive "shellcode"'
suppression:
  window: 24 hours
tuning_period: 7 days
