rule_id: TDL-AUTH-000272
v4_id: '000272'
name: SQL Login Attempts Failed
description: Detects when there are multiple failed login attempts against the SQL database with a short timeframe
tactic: Initial Access
tactic_id: TA0001
technique_id: T1078
technique_name: Valid Accounts
platform:
- Windows
data_sources:
- Windows Operating System
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: |-
    index=windows
    | where EventCode=18456
    | bucket _time span=1m
    | stats count by src_ip, Account_Name, _time
    | where count >= 3
    | table _time, host, Account_Name, IpAddress, LogonType
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID == 18456
    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 1m)
    | where Count >= 3
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 60 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_auth_000272 {
      meta:
        author = "TDE"
        description = "SQL Login Attempts Failed"
        severity = "LOW"
        tactic = "TA0001"
        technique = "T1078"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 1m

      condition:
        #event >= 3

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 1m)
    | WHERE event_count >= 3
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 3)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 3
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 3\n| fields hostname, actor_effective_username,\
    \ event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- auth
- initial-access
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '3 SQL login Failure Events

  Where the Event ID is 18456

  Within 1 minute'
suppression:
  window: 24 hours
tuning_period: 7 days
