rule_id: TDL-AUTH-000088
v4_id: 000088
name: Excessive Phishing Clicks Blocked by User
description: Detects when a recipient clicks on a phishing link multiple times. This could be an indication that the recipient
  needs phishing awareness training to reduce risk.
tactic: Initial Access
tactic_id: TA0001
technique_id: T1566
technique_name: Phishing
platform:
- Windows
data_sources:
- Email Security
- Mimecast TTP
- ProofPoint TAP
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=windows

    | bucket _time span=5m

    | stats count by src_ip, Account_Name, _time

    | where count >= 3

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)

    | where Count >= 3

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_auth_000088 {\n  meta:\n    author = \"TDL\"\n    description = \"Excessive Phishing Clicks Blocked by\
    \ User\"\n    severity = \"LOW\"\n    tactic = \"TA0001\"\n    technique = \"T1566\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 3\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 3

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 3)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 3

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 3\n| fields hostname, actor_effective_username,\
    \ event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- net
- initial-access
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '3 URL Click Blocked Events

  With the same URL and Source Usernames

  Within 5 minutes'
suppression:
  window: 24 hours
tuning_period: 7 days
