rule_id: TDL-EXF-000063
v4_id: '000063'
name: POST Data Exfiltration to Paste Site
description: The HTTP POST method is used to upload or store data on a web server. There are several sites such as Pastebin,
  Pastee, and Ghostbin that are a popular for leaking data. Since these are open to anyone an attacker could use them for
  exfilration.
tactic: Exfiltration
tactic_id: TA0010
technique_id: T1567
technique_name: Exfiltration Over Web Service
platform:
- Windows
data_sources:
- Forward Proxy
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=network

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT sourceip, destinationip, destinationport, SUM(flowCount) AS total_flows
    FROM flows
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY sourceip, destinationip, destinationport
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_exf_000063 {
      meta:
        author = "TDL"
        description = "POST Data Exfiltration to Paste Site"
        severity = "MEDIUM"
        tactic = "TA0010"
        technique = "T1567"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-network*,logs-firewall*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"NETWORK\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Whitelist login URLs
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- net
- exfiltration
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: |-
  1 Forward Proxy Event
  From one internal source to one external destination (Outbound)
  Where the Destination Domain is on the Paste Site Domains List
  Where the Request Method is "POST"
suppression:
  window: 12 hours
tuning_period: 7 days
