rule_id: TDL-EXF-000495
v4_id: 000495
name: Spike in BytesOut from an Internal IP
description: Detects when a internal host has a spike in internal SMB connections within the organization's network.
tactic: Exfiltration
tactic_id: TA0010
technique_id: T1030
technique_name: Data Transfer Size Limits
platform:
- Network
data_sources:
- Firewall
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=network

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: |-
    CommonSecurityLog
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, SourceIP, DestinationIP, DestinationPort, DeviceAction
  aql: |-
    SELECT sourceip, destinationip, destinationport, SUM(flowCount) AS total_flows
    FROM flows
    WHERE INOFFSET(starttime, LAST 180 SECONDS)
    GROUP BY sourceip, destinationip, destinationport
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_exf_000495 {
      meta:
        author = "TDL"
        description = "Spike in BytesOut from an Internal IP"
        severity = "MEDIUM"
        tactic = "TA0010"
        technique = "T1030"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 3m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-network*,logs-firewall*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 3m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"NETWORK\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- exfiltration
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: |-
  Firewall Events
  From an internal source to an external destination (Outbound)

  Baseline Type: Daily
  Entity: Source IP

  Baseline Learning: 30 Days
  Retention: 90 Days

  Outlier: avg
  Field: bytesOut
  Sensitivity: 3
  Minimum: 1000000
