rule_id: TDL-EXE-000152
v4_id: '000152'
name: PSEXEC Detection
description: Detects an attacker pivoting internally using PSEXEC. PSEXEC is a common administrator tool used to remotely
  execute commands and manage systems. PSEXEC connects to the ADMIN$ share of an internal host and then immediately installs
  a windows service image. This rule is designed to detect this type of activity.
tactic: Execution
tactic_id: TA0002
technique_id: T1021
technique_name: Remote Services
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688, 5140, 4697'
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=5140 OR EventCode=4697 OR EventCode=4688)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 5140, 4697, 4688)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid IN (4688, 4697)\n  AND INOFFSET(starttime, LAST 120 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_exe_000152 {\n  meta:\n    author = \"TDL\"\n    description = \"PSEXEC Detection\"\n    severity = \"\
    MEDIUM\"\n    tactic = \"TA0002\"\n    technique = \"T1021\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 2m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'', ''4697'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 2m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688, 4697])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=UserLogon

    | where LogonType = 3 AND AuthenticationPackage = "NTLM" AND UserName!="*$"

    | stats dc(RemoteIP) as src_count by UserName, aid

    | where src_count >= 3'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688, 4697)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688 OR 4697)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1021*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: "1 Windows Process Execution Event \nWhere the Event ID is in [592, 4688]\nWhere the Process Name is psexec.exe\n\
  \n---------------------------------------------------------------------------------------------------------------\n\n1 Windows\
  \ Network Share Object Accessed Event\nWhere the Event ID is in [5140, 5145]\nWhere the Share Name is in [\\\\*\\C$, \\\\\
  *\\ADMIN$]\n\t\nFollowed By\n\t\n1 Windows Service Installed Event\nWhere the Event ID is in [601, 4697]\nWithin the same\
  \ Source and Destination in the previous event\nWithin 2 minutes"
suppression:
  window: 12 hours
  fields:
  - Source Username
tuning_period: 7 days
