rule_id: TDL-EXE-000424
v4_id: '000424'
name: Possible Impacket Lateral Movement
description: Detects commands from the Impacket framework where an attacker will attempt to use an semi-interactive shell
  via WMI or SMB to execute commands for lateral movement.
tactic: Execution
tactic_id: TA0002
technique_id: T1047
technique_name: Windows Management Instrumentation
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688'
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: |-
    index=windows
    | where (EventCode=4688 OR EventCode=4688)
    | table _time, host, user, ProcessName, CommandLine
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID in (4688, 4688)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE eventid = 4688
      AND INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC
  yara_l: |-
    rule zs_exe_000424 {
      meta:
        author = "TDL"
        description = "Possible Impacket Lateral Movement"
        severity = "MEDIUM"
        tactic = "TA0002"
        technique = "T1047"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.metadata.product_event_type = "4688"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | WHERE event.code IN ('4688')
    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT event_count DESC
  leql: |-
    where(event_id IN [4688])
    groupby(hostname, username)
    calculate(count AS event_count)
  crowdstrike: |-
    event_simpleName=UserLogon
    | where LogonType = 3 AND AuthenticationPackage = "NTLM" AND UserName!="*$"
    | stats dc(RemoteIP) as src_count by UserName, aid
    | where src_count >= 3
  xql: |-
    dataset = xdr_data
    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)
    | filter _time > to_timestamp(now() - 86400, "epoch")
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time
    | sort desc _time
  lucene: event_id:(4688)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 14 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: |-
  1 Windows Process Creation Event
  Where the Event ID is in [592, 4688]
  Where Parent Process Name contains "wmiprvse.exe" or Parent Process Name contains "services.exe"
  AND CommandLine contains 'cmd.exe' and '/q' and '\\\\127.0.0.1\\' and '&1'
suppression:
  window: 12 hours
  fields:
  - src_hostname
tuning_period: 14 days
