rule_id: TDL-EXE-000533
v4_id: '000533'
name: Script/CLI UserAgent string
description: This pattern discovers HTTP communications from an internal source where a development library or command line
  client user-agent string was observed (e.g. Wget, cURL, etc.). Use of these techniques by attackers is described in https://attack.mitre.org/techniques/T1105/
  and https://attack.mitre.org/techniques/T1064/.
tactic: Execution
tactic_id: TA0002
technique_id: T1105
technique_name: Ingress Tool Transfer
platform:
- AWS
data_sources:
- AWS ELB
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: 'index=aws sourcetype=aws:cloudtrail

    | table _time, src_ip, dest_ip, dest_port, action'
  kql: 'AWSCloudTrail

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_exe_000533 {\n  meta:\n    author = \"TDL\"\n    description = \"Script/CLI UserAgent string\"\n    severity\
    \ = \"LOW\"\n    tactic = \"TA0002\"\n    technique = \"T1105\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 5m\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-aws.cloudtrail*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort\
    \ desc _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*aws*

    | parse regex "\"userIdentity\":\{\"arn\":\"(?<actor>[^\"]+)" nodrop

    | where _raw matches "*T1105*"

    | count by actor, eventName, sourceIPAddress

    | sort by _count desc'
false_positives:
- Authorized scanners
- Monitoring agents
tuning_guidance: Tune per environment baseline.
tags:
- net
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
