rule_id: TDL-EXE-000151
v4_id: '000151'
name: Service Installation - HVT
description: Detects a new service installed on a HVT host. Attackers will commonly establish persistent access to a compromised
  host by installing a new service to run their code. HVT hosts should not typically have frequent service installations,
  so any instances should be considered suspicious. The alert will be sent as a report for the first 30 days then moved to
  an alert.
tactic: Execution
tactic_id: TA0002
technique_id: T1569
technique_name: System Services
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4697'
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 75
queries:
  spl: 'index=windows

    | where (EventCode=4697 OR EventCode=4697)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4697, 4697)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4697\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_exe_000151 {\n  meta:\n    author = \"TDL\"\n    description = \"Service Installation - HVT\"\n    severity\
    \ = \"HIGH\"\n    tactic = \"TA0002\"\n    technique = \"T1569\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4697\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4697'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4697])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4697

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4697)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4697)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1569*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Windows Service Installed Event

  Where the Event ID is in [601, 4697]

  Where the Source Username does NOT end with "$"

  Where the Destination Hostname is on the High Value Target Host List'
suppression:
  window: 8 hours
  fields:
  - Source Hostname
tuning_period: 7 days
