rule_id: TDL-EXE-000573
v4_id: '000573'
name: Kubernetes Pod Created with hostNetwork
description: Detect when a pod is attached to the host network. Attaching the hostNetwork permits a pod to access the node’s
  network adapter allowing a pod to listen to all network traffic for all pods on the node and communicate with other pods
  on the network namespace.
tactic: Execution
tactic_id: TA0002
technique_id: T1611
technique_name: Escape to Host
platform:
- Windows
data_sources:
- Kubernetes
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_exe_000573 {
      meta:
        author = "TDE"
        description = "Kubernetes Pod Created with hostNetwork"
        severity = "MEDIUM"
        tactic = "TA0002"
        technique = "T1611"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: Tune per environment baseline.
tags:
- edp
- execution
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Kubernetes Event \nWhere the Resource is \"pods\"\nWhere Verb is \"create\"\nWhere the requestObject.spec.hostNetwork\
  \ is \"true\"\nWhere the Source Username is NOT \"system:serviceaccount:kube-system:replicaset-controller\"\nWhere the Source\
  \ Username is NOT \"system:serviceaccount:kube-system:daemon-set-controller\""
