rule_id: TDL-EXE-000664
v4_id: '000664'
name: High Risk Scheduled Task Deleted
description: This detection rule identifies Event ID 4699 (a scheduled task was deleted) in conjunction with critical process
  names such as WindowsUpdate, BitLocker, Defender and . The focus is to monitor the deletion of scheduled tasks associated
  with key system operations, which could indicate malicious activity attempting to disrupt essential security and update
  processes. Alerts generated by this rule should be investigated promptly to ensure system integrity and security remain
  intact.”
tactic: Execution
tactic_id: TA0002
technique_id: T1053
technique_name: Scheduled Task or Job
platform:
- Windows
data_sources:
- Microsoft Windows
- 'Event IDs: 4699'
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: |-
    index=windows
    | where (EventCode=4699 OR EventCode=4699)
    | table _time, host, Account_Name, IpAddress, LogonType
  kql: |-
    SecurityEvent
    | where TimeGenerated >= ago(1d)
    | where EventID in (4699, 4699)
    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE eventid = 4699
      AND INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC
  yara_l: |-
    rule zs_exe_000664 {
      meta:
        author = "TDE"
        description = "High Risk Scheduled Task Deleted"
        severity = "HIGH"
        tactic = "TA0002"
        technique = "T1053"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.metadata.product_event_type = "4699"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-windows.sysmon_operational*,logs-system.security*
    | WHERE @timestamp > NOW() - 1 day
    | WHERE event.code IN ('4699')
    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT event_count DESC
  leql: |-
    where(event_id IN [4699])
    groupby(hostname, username)
    calculate(count AS event_count)
  crowdstrike: |-
    event_simpleName=SecurityEvent
    | where EventCode=4699
    | table ComputerName, UserName, CommandLine, ContextTimeStamp
  xql: |-
    dataset = xdr_data
    | filter event_type = "PROCESS" and action_evtlog_event_id in (4699)
    | filter _time > to_timestamp(now() - 86400, "epoch")
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time
    | sort desc _time
  lucene: event_id:(4699)
false_positives:
- Legitimate admin activity
- Authorized service accounts
tuning_guidance: Tune per environment baseline.
tags:
- auth
- execution
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Security Event\nWhere Event ID 4699\nWhere Taskname contains either\n\"*\\\\Windows\\\\SystemRestore\\\
  \\SR*\" \n\"*\\\\Windows\\\\Windows\\\\Defender*\" \n\"*\\\\Windows\\\\BitLocker*\" \n\"*\\\\Windows\\\\WindowsBackup*\"\
  \ \n\"*\\\\Windows\\\\WindowsUpdate*\" \n\"*\\\\Windows\\\\UpdateOrchestrator\\\\Schedule*\" \n\"*\\\\Windows\\\\ExploitGuard*\"\
  \nAND src_user(subject username) is not a machine account \"*$\""
