rule_id: TDL-EXE-000572
v4_id: '000572'
name: Kubernetes Pod Created in Kube Namespace
description: Detect when a user is creating a pod in one of the Kubernetes default namespaces. The only users creating pods
  in the kube-system namespace should be cluster administrators. Furthermore, it is best practice to not run any cluster critical
  infrastructure in the kube-system namespace. The kube-public namespace is intended for Kubernetes objects which should be
  readable by unauthenticated users. Thus, a pod should likely not be created in the kube-public namespace.
tactic: Execution
tactic_id: TA0002
technique_id: T1611
technique_name: Escape to Host
platform:
- Windows
data_sources:
- Kubernetes
severity: Medium
fidelity: Medium
lifecycle: Proposed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_exe_000572 {\n  meta:\n    author = \"TDL\"\n    description = \"Kubernetes Pod Created in Kube Namespace\"\
    \n    severity = \"MEDIUM\"\n    tactic = \"TA0002\"\n    technique = \"T1611\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1611*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: Tune per environment baseline.
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Kubernetes Event \nWhere the Resource is \"pods\"\nWhere Verb is \"create\"\nWhere the Namespace is \"kube-system\"\
  \ OR \"kube-public\"\nWhere the Source Username is NOT \"system:serviceaccount:kube-system:replicaset-controller\"\nWhere\
  \ the Source Username is NOT \"system:serviceaccount:kube-system:job-controller\"\nWhere the Source Username is NOT \"system:serviceaccount:kube-system:daemon-set-controller\""
