rule_id: TDL-EXE-000047
v4_id: '000047'
name: Malware Not Cleaned
description: This rule is designed to alert on malware detected by the AV that was not successfully quarantined or removed.
  Investigation on the file and host should be performed. As well as RCA to determine why the file was not quarantined.
tactic: Execution
tactic_id: TA0002
technique_id: T1204
technique_name: User Execution
platform:
- Windows
data_sources:
- Antivirus
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 3600 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_exe_000047 {\n  meta:\n    author = \"TDL\"\n    description = \"Malware Not Cleaned\"\n    severity =\
    \ \"MEDIUM\"\n    tactic = \"TA0002\"\n    technique = \"T1204\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 1h\n\n \
    \ condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 1h)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1204*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Malware Detection Event

  Where the Action is does NOT contain one of: [Clean, Delete, Quarantine, Clear]

  Where the Source Hostname is NOT on the High Value Target Host List


  NOT Followed By


  1 Malware Detection Event

  Where the Action contains one of: [Clean, Delete, Quarantine, Clear]

  With the same Source Host, Signature and File Hash from the previous event

  Within 1 hour'
suppression:
  window: 12 hours
  fields:
  - Source Hostname
  - File Hash
tuning_period: 7 days
