rule_id: TDL-EXE-000378
v4_id: 000378
name: Command Execution on VM - Azure
description: Adversaries may abuse access to virtual machines by executing a script through various methods in order to gain
  access to the Virtual Machine.
tactic: Execution
tactic_id: TA0002
technique_id: T1059
technique_name: Command and Scripting Interpreter
platform:
- Azure
data_sources:
- Azure
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=azure

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_exe_000378 {\n  meta:\n    author = \"TDL\"\n    description = \"Command Execution on VM - Azure\"\n  \
    \  severity = \"LOW\"\n    tactic = \"TA0002\"\n    technique = \"T1059\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-azure*,logs-o365*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = cloud_audit_log\n| filter event_type = \"CLOUD\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\"\
    )\n| fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort\
    \ desc _time"
  lucene: event_id:* AND log_type:"security"
  sumo: '_sourceCategory=*azure*

    | parse regex "\"userIdentity\":\{\"arn\":\"(?<actor>[^\"]+)" nodrop

    | where _raw matches "*T1059*"

    | count by actor, eventName, sourceIPAddress

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 14 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '1 Azure Activity Event

  Where Event Name is in ["MICROSOFT.COMPUTE/VIRTUALMACHINES/RUNCOMMAND/ACTION", "MICROSOFT.COMPUTE/VIRTUALMACHINES/EXTENSIONS/WRITE"]

  Where Action is in ["success"]'
suppression:
  window: 24 hours
tuning_period: 14 days
