rule_id: TDL-EXE-000049
v4_id: 000049
name: Malware Outbreak
description: Detects situations where an antivirus has detected the same threat on multiple hosts.  Multiple infections can
  indicate that the malware is spreading between the hosts directly or has infected the hosts through a common external site
  or download.
tactic: Execution
tactic_id: TA0002
technique_id: T1204
technique_name: User Execution
platform:
- Windows
data_sources:
- Antivirus
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 75
queries:
  spl: 'index=windows

    | bucket _time span=30m

    | stats count by src_ip, Account_Name, _time

    | where count >= 6

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 30m)

    | where Count >= 6

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 1800 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_exe_000049 {\n  meta:\n    author = \"TDE\"\n    description = \"Malware Outbreak\"\n    severity = \"\
    HIGH\"\n    tactic = \"TA0002\"\n    technique = \"T1204\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n    $host over 30m\n\n\
    \  condition:\n    #event >= 6\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 30m)

    | WHERE event_count >= 6

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 6)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 6

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | comp count() as event_count by hostname, actor_effective_username\n| filter event_count >= 6\n| fields hostname, actor_effective_username,\
    \ event_count"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '6 Malware Detection Events

  With the same File Hash/Signature

  With unique Source Hostnames

  Within 30 minutes'
suppression:
  window: 8 hours
  fields:
  - File Hash/Signature
tuning_period: 7 days
