rule_id: TDL-EXE-000246
v4_id: '000246'
name: PowerShell Remote Execution
description: PowerShell can be used to execute commands on remote computers using WinRM over WMI. Attackers can use this as
  an alternative to PSEXEC tools to pivot and maintain access to compromised hosts. Alert will be sent in a weekly report
  only for the first 30 days from implementation.
tactic: Execution
tactic_id: TA0002
technique_id: T1047
technique_name: Windows Management Instrumentation
platform:
- Windows
data_sources:
- Windows Operating System
- Powershell Script Block
- 'Event IDs: 4688'
severity: Low
fidelity: Low
lifecycle: Proposed
risk_score: 30
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=4688)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 4688)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_exe_000246 {\n  meta:\n    author = \"TDE\"\n    description = \"PowerShell Remote Execution\"\n    severity\
    \ = \"LOW\"\n    tactic = \"TA0002\"\n    technique = \"T1047\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\
    \n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Execution Event\nWhere the Event ID is in [592, 4688]\nOR\n\tWhere the Parent Process Name\
  \ is wmiprvse.exe\n\tWhere the Process Name is wsmprovhost.exe\n\nNOT (Where the Process Name is \"DismHost.exe\" AND the\
  \ Process Path starts with \"C:\\Windows\\Temp\\\")"
suppression:
  window: 24 hours
tuning_period: 7 days
