rule_id: TDL-EXE-000171
v4_id: '000171'
name: MS Office Spawning Command Line Tools
description: Detects an embedded Microsoft Office application macro attempting to spawn command line tools such as cmd.exe
  or powershell.exe. In recent years, attackers have been embedding macros in Office applications to run these command line
  tools to compromise the host.
tactic: Execution
tactic_id: TA0002
technique_id: T1202
technique_name: Indirect Command Execution
platform:
- Windows
data_sources:
- Windows Operating System
severity: High
fidelity: High
lifecycle: Proposed
risk_score: 75
queries:
  spl: 'index=windows

    | where EventCode=4688

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID == 4688

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_exe_000171 {\n  meta:\n    author = \"TDL\"\n    description = \"MS Office Spawning Command Line Tools\"\
    \n    severity = \"HIGH\"\n    tactic = \"TA0002\"\n    technique = \"T1202\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
  sumo: '_sourceCategory=*windows*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1202*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: none
pseudo_logic: "1 Windows Process Execution Event \nWhere the Event ID is in [592, 4688]\nWhere the Parent Process Name is\
  \ in [winword.exe, excel.exe, powerpnt.exe, msaccess.exe, outlook.exe, visio.exe, winproj.exe]\nWhere the Process Name is\
  \ cmd.exe"
suppression:
  window: 8 hours
  fields:
  - Source Username
tuning_period: 7 days
