rule_id: TDL-EXE-000245
v4_id: '000245'
name: Recon Commands
description: Detects an attacker that may have compromised an internal host and is now running commands via command prompt
  or PowerShell in an attempt to map the network. This activity has been made as a building block instead of an alert to account
  for legitimate users that may run one off recon commands.
tactic: Execution
tactic_id: TA0002
technique_id: T1005
technique_name: Data from Local System
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688'
severity: Low
fidelity: Low
lifecycle: Deployed
risk_score: 30
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=4688)

    | bucket _time span=5m

    | stats count by src_ip, Account_Name, _time

    | where count >= 2

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 4688)

    | summarize Count = count() by Account, IpAddress, bin(TimeGenerated, 5m)

    | where Count >= 2

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    HAVING event_count >= 2\nORDER BY starttime DESC"
  yara_l: "rule zs_exe_000245 {\n  meta:\n    author = \"TDL\"\n    description = \"Recon Commands\"\n    severity = \"LOW\"\
    \n    tactic = \"TA0002\"\n    technique = \"T1005\"\n\n  events:\n    $event.metadata.event_type = \"GENERIC_EVENT\"\n\
    \    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 2\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 2

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(source_ip, username, hostname)

    calculate(count AS event_count)

    having(event_count >= 2)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | stats count as events by ComputerName, UserName

    | where events >= 2'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | comp count() as event_count by hostname, actor_effective_username

    | filter event_count >= 2

    | fields hostname, actor_effective_username, event_count'
  lucene: event_id:(4688)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1005*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- execution
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: '2 or more Windows Process Executions

  Where the Event ID is in [592, 4688]

  Where the Command contains one of [whoami, ipconfig, nestat, tasklist, ver, systeminfo, net time, net start, qprocess, query,
  dir, net view, ping, net use, type, net user, net localgroup, net group, net config, net share]'
suppression:
  window: 12 hours
tuning_period: 7 days
