rule_id: TDL-LM-000266
v4_id: '000266'
name: Malicious P2P Traffic - Outbound
description: Detects outbound P2P traffic that is of high severity based on threat feed
tactic: Lateral Movement
tactic_id: TA0008
technique_id: T1021
technique_name: Remote Services
platform:
- Windows
data_sources:
- Application Control
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | table _time, host, user, _raw'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: 'SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount

    FROM events

    WHERE INOFFSET(starttime, LAST 300 SECONDS)

    GROUP BY username, hostname, QIDNAME(qid)

    ORDER BY starttime DESC'
  yara_l: "rule zs_lm_000266 {\n  meta:\n    author = \"TDE\"\n    description = \"Malicious P2P Traffic - Outbound\"\n  \
    \  severity = \"MEDIUM\"\n    tactic = \"TA0008\"\n    technique = \"T1021\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid = $user\n\n  match:\n \
    \   $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT @timestamp DESC'
  leql: 'where(logset = "Endpoint Activity")

    groupby(hostname, username)

    calculate(count AS event_count)

    having(event_count >= 1)'
  crowdstrike: 'event_simpleName=ProcessRollup2

    | stats count as proc_count by ComputerName, FileName

    | where proc_count >= 1

    | sort -proc_count'
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Authorized pen testing
- Security research
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- thr
- lateral-movement
author: TDE/TDE
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: "1 Application Control Event\nWhere the Application Category is \"P2P\"\nOR\n\tWhere the Destination IP is on\
  \ a Threat Intelligence List\n\t\n\tWhere the Destination Domain is on a Threat Intelligence List"
suppression:
  window: 12 hours
tuning_period: 7 days
