title: Pass-the-Hash NTLM Lateral Movement
id: TDL-LM-001
status: stable
description: ''
references: []
author: TDL
date: '2024-02-10'
modified: '2026-04-27'
tags:
- attack.lateral-movement
- attack.t1550_002
- detection.pass-the-hash
- detection.ntlm
- detection.lateral-movement
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 7045
    ServiceName|contains: PSEXESVC
  condition: selection
falsepositives:
- Legitimate admin accounts managing multiple systems
level: high
