title: Object on Admin File Share Accessed with Write Permissions
id: TDL-LM-000588
status: experimental
description: Detects when an unauthorized non-system account accesses a file on the admin share via SMB
  with write access (0x2).
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.lateral-movement
- attack.t1021
- detection.auth
- detection.lateral-movement
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 51451
    - 5145
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: 000588
