rule_id: TDL-PE-000363
v4_id: '000363'
name: Meterpreter or Cobalt Strike Getsystem Usage
description: Detects the use of Meterpreter/Cobalt Strike 'getsystem' command by detecting a specific service starting with
  a named pipe or DLL load. This command is used to elevate the user from localadmin to SYSTEM user.
tactic: Privilege Escalation
tactic_id: TA0004
technique_id: T1134
technique_name: Access Token Manipulation
platform:
- Windows
data_sources:
- Windows Operating System
- 'Event IDs: 4688'
severity: Medium
fidelity: Medium
lifecycle: Deployed
risk_score: 55
queries:
  spl: 'index=windows

    | where (EventCode=4688 OR EventCode=4688)

    | table _time, host, user, ProcessName, CommandLine'
  kql: 'SecurityEvent

    | where TimeGenerated >= ago(1d)

    | where EventID in (4688, 4688)

    | project TimeGenerated, Computer, Account, IpAddress, EventID, Activity'
  aql: "SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount\nFROM\
    \ events\nWHERE eventid = 4688\n  AND INOFFSET(starttime, LAST 300 SECONDS)\nGROUP BY username, hostname, QIDNAME(qid)\n\
    \nORDER BY starttime DESC"
  yara_l: "rule zs_pe_000363 {\n  meta:\n    author = \"TDL\"\n    description = \"Meterpreter or Cobalt Strike Getsystem\
    \ Usage\"\n    severity = \"MEDIUM\"\n    tactic = \"TA0004\"\n    technique = \"T1134\"\n\n  events:\n    $event.metadata.event_type\
    \ = \"GENERIC_EVENT\"\n    $event.metadata.product_event_type = \"4688\"\n    $event.principal.hostname = $host\n    $event.principal.user.userid\
    \ = $user\n\n  match:\n    $host over 5m\n\n  condition:\n    #event >= 1\n\n  outcome:\n    $risk_score = max(50)\n}"
  esql: 'FROM logs-windows.sysmon_operational*,logs-system.security*

    | WHERE @timestamp > NOW() - 1 day

    | WHERE event.code IN (''4688'')

    | STATS event_count = COUNT(*) BY host.name, user.name, event.code, @timestamp = BUCKET(@timestamp, 5m)

    | WHERE event_count >= 1

    | SORT event_count DESC'
  leql: 'where(event_id IN [4688])

    groupby(hostname, username)

    calculate(count AS event_count)'
  crowdstrike: 'event_simpleName=SecurityEvent

    | where EventCode=4688

    | table ComputerName, UserName, CommandLine, ContextTimeStamp'
  xql: 'dataset = xdr_data

    | filter event_type = "PROCESS" and action_evtlog_event_id in (4688)

    | filter _time > to_timestamp(now() - 86400, "epoch")

    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time

    | sort desc _time'
  lucene: event_id:(4688)
  sumo: '_sourceCategory=*ids*

    | parse "EventID=*\"" as event_id nodrop

    | where event_id="1" AND _raw matches "*T1134*"

    | count by host, user, parent_process_name, command_line

    | sort by _count desc'
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 30 days.'
tags:
- edp
- privilege-escalation
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: "1 Windows Process Creation Event\nWhere the Event ID is in [592, 4688]\nWhere Parent Process Name equals \"\
  services.exe\"\nAND\n\tCommand Line contains all of [\"\\pipe\\\", \"/c\", \"echo\"]\n\tAND Command Line contains any of\
  \ [\"cmd\", \"%comspec%\"]\nOR\n\tCommand Line contains all of [\"rundll32\", \".dll,a\", \"/p\"]\nAND Command Line does\
  \ not contains \"mpcmdrun\""
tuning_period: 30 days
