rule_id: TDL-PE-000186
v4_id: 000186
name: Sudo File Modified
description: Detects a user modifying the sudoer file on a host. An attacker may attempt to escalate privileges by adding
  compromised accounts directly to the sudoer file to gain root permissions. These direct modifications should be considered
  suspicious since most sudo additions occur through the adduser or usermod commands.
tactic: Privilege Escalation
tactic_id: TA0004
technique_id: T1548
technique_name: Abuse Elevation Control Mechanism
platform:
- Linux
data_sources:
- Linux Operating System
severity: High
fidelity: High
lifecycle: Deployed
risk_score: 75
queries:
  spl: 'index=linux

    | table _time, host, user, ProcessName, CommandLine'
  kql: |-
    Syslog
    | where TimeGenerated >= ago(1d)
    | project TimeGenerated, Computer, Account, Activity
  aql: |-
    SELECT LOGSOURCENAME(logsourceid) AS log_source, username, hostname, QIDNAME(qid) AS event_name, eventcount
    FROM events
    WHERE INOFFSET(starttime, LAST 300 SECONDS)
    GROUP BY username, hostname, QIDNAME(qid)
    ORDER BY starttime DESC
  yara_l: |-
    rule zs_pe_000186 {
      meta:
        author = "TDL"
        description = "Sudo File Modified"
        severity = "HIGH"
        tactic = "TA0004"
        technique = "T1548"

      events:
        $event.metadata.event_type = "GENERIC_EVENT"
        $event.principal.hostname = $host
        $event.principal.user.userid = $user

      match:
        $host over 5m

      condition:
        #event >= 1

      outcome:
        $risk_score = max(50)
    }
  esql: |-
    FROM logs-system.syslog*,logs-auditd*
    | WHERE @timestamp > NOW() - 1 day
    | STATS event_count = COUNT(*) BY host.name, user.name, @timestamp = BUCKET(@timestamp, 5m)
    | WHERE event_count >= 1
    | SORT @timestamp DESC
  leql: |-
    where(logset = "Endpoint Activity")
    groupby(hostname, username)
    calculate(count AS event_count)
    having(event_count >= 1)
  crowdstrike: |-
    event_simpleName=ProcessRollup2
    | stats count as proc_count by ComputerName, FileName
    | where proc_count >= 1
    | sort -proc_count
  xql: "dataset = xdr_data\n| filter event_type = \"PROCESS\" \n| filter _time > to_timestamp(now() - 86400, \"epoch\")\n\
    | fields hostname, actor_effective_username, action_process_image_name, action_process_command_line, _time\n| sort desc\
    \ _time"
  lucene: event_id:* AND log_type:"security"
false_positives:
- Security software
- Authorized admin tools
tuning_guidance: 'Tune per environment baseline. Tuning period: 7 days.'
tags:
- edp
- privilege-escalation
author: TDL
created: '2024-01-01'
last_modified: '2026-04-27'
test_method: historical
pseudo_logic: |-
  1 Linux Command Line Event
  Where the Command contains "visudo"
  Where the Command contains "etc/sudoers" OR "sudoers"
suppression:
  window: 8 hours
tuning_period: 7 days
