title: Credential Dumping
id: TDL-CA-000202
status: experimental
description: Detects the dumping of memory or registry hives to gain credentials. The tool Procdump or
  Task Manager can be used to dump the memory of the lsass.exe. The lsass process is responsible for the
  authentication of users on a Windows host. Procdump is a tool that can dump a process’ memory to a file.
  The Task Manager can also be used to dump any process’ memory in the GUI. By dumping the memory of lsass.exe,
  an attacker can search the memory for plaintext passwords that were inputted during authentication and
  compromise the accounts. Alternatively, an attacker can use reg.exe to download the Security Account
  Manager (SAM) registry hive, which contains user password hashes. These hashes can then be cracked or
  used in pass-the-hash attacks at a later time.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1003
- detection.edp
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    - 4657
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000202'
