title: Potential Lambda Layer Injection Attempt
id: TDL-CA-000648
status: experimental
description: Detects when an attacker introduces a malicious Lambda layer to an existing Lambda function.
  Once the function executes, the malicious code in the layer can leverage the function's IAM role to
  make unauthorized AWS API calls.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1078
- detection.auth
- detection.credential-access
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - Potential Lambda Layer Injection Attempt
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000648
