title: DSRM Persistence Usage
id: TDL-CA-000695
status: experimental
description: Detects the usages of a DSRM account for persistence on a host. The DSRM account, being a
  local administrator account on the DC, is not subject to domain password policies. However, by default,
  its use is limited to specific conditions, such as when the DC is booted into DSRM. These limitations
  can be bypassed by altering the registry key responsible for the account’s logon behavior.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1078
- detection.auth
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46571
    - 4657
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: 000695
