title: DCSync Attack - Replication Rights Abuse
id: TDL-CA-004
status: stable
description: ''
references: []
author: TDL
date: '2024-02-04'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1003_006
- detection.dcsync
- detection.mimikatz
- detection.active-directory
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4662
    ObjectClass: domainDNS
    Properties|contains|any:
    - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
    - 1131f6ab-9c07-11d1-f79f-00c04fc2dcd2
  condition: selection
falsepositives:
- Azure AD Connect
- Backup solutions with AD replication permissions
level: critical
