title: LDAP Kerberos Recon - Defender
id: TDL-CA-000638
status: experimental
description: Identifies LDAP search activity that focuses on Kerberos-related attributes and security
  principals often queried by attackers during pre-authentication reconnaissance.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1558
- detection.edp
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - LDAP Kerberos Recon - Defender
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: low
custom:
  v4_id: 000638
