title: Windows Credential Editor Usage
id: TDL-CA-000226
status: experimental
description: Windows Credential Editor is a password dumping tool.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1003
- detection.edp
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4688
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000226'
