title: AWS Instance Credential Exfiltration - GuardDuty
id: TDL-CA-000307
status: stable
description: Detects when an external address or an address tied to an exisiting AWS account has attempted
  to run AWS API operations using temporary AWS credentials that were created on an EC2 instance in your
  AWS environment. The listed EC2 instance might be compromised, and the temporary credentials from this
  instance might have been exfiltrated to a remote host outside of AWS. AWS does not recommend redistributing
  temporary credentials outside of the entity that created them (for example, AWS applications, EC2, or
  Lambda). However, authorized users can export credentials from their EC2 instances to make legitimate
  API calls. To rule out a potential attack and verify the legitimacy of the activity, validate if the
  use of instance credentials from the remote IP in the finding is expected.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1552
- detection.auth
- detection.credential-access
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS Instance Credential Exfiltration - GuardDuty
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000307'
