title: Kubernetes Secrets Deleted
id: TDL-CA-000562
status: experimental
description: Detects a secret being deleted within a kubernetes instance. Sometimes secret deletion is
  part of a normal buisness procedure so by itself it may not be a threat. However, it can be great context
  in conjunction to other alerts
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1552
- detection.auth
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Kubernetes Secrets Deleted
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000562'
