title: Password Spraying Against Active Directory
id: TDL-CA-003
status: stable
description: ''
references: []
author: TDL
date: '2024-02-03'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1110_003
- detection.password-spray
- detection.brute-force
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4625
    Keywords:
    - '0xC000006A'
    - '0xC0000064'
    - '0xC000006D'
  condition: selection
falsepositives:
- Misconfigured applications
- VDI spin-up
level: high
