title: Kerberoasting - Large Volume TGS Requests
id: TDL-CA-002
status: stable
description: ''
references: []
author: TDL
date: '2024-02-02'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1558_003
- detection.kerberoasting
- detection.active-directory
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4769
    TicketEncryptionType:
    - '0x17'
    - '0x18'
  condition: selection
falsepositives:
- Monitoring tools enumerating SPNs
level: high
