title: Windows Shadow Copy Creation
id: TDL-CA-000115
status: experimental
description: Detects when an attacker utilizes Windows shadow copy to copy the password hashes or system
  registry from a Domain Controller.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1003
- detection.auth
- detection.credential-access
logsource:
  category: ps_script
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    Image|endswith|any:
    - \vssadmin.exe
    - \wmic.exe
    - \wbadmin.exe
    CommandLine|contains|any:
    - delete
    - shadowcopy
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: high
custom:
  v4_id: '000115'
