title: LSASS Memory Access by Non-System Process
id: TDL-CA-001
status: stable
description: ''
references: []
author: TDL
date: '2024-02-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1003_001
- detection.lsass
- detection.credential-dumping
- detection.mimikatz
logsource:
  category: process_access
  product: windows
detection:
  selection:
    TargetImage|endswith: \lsass.exe
    GrantedAccess|contains|any:
    - '0x1010'
    - '0x1410'
    - '0x1fffff'
    - '0x1438'
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- AV/EDR products
- Windows Error Reporting
level: critical
