title: Kerberoasting Activity
id: TDL-CA-000019
status: stable
description: Kerberoasting can be an effective method for extracting service account credentials from
  Active Directory as a regular user without having to escalate privileges. This attack is effective because
  service accounts are typically given easy passwords and set to never expire which makes brute forcing
  them a viable method of attack.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1558
- detection.edp
- detection.credential-access
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 47697
    - 4769
    TicketEncryptionType:
    - '0x17'
    - '0x18'
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000019
