title: Account Guessing
id: TDL-CA-000037
status: stable
description: Detects a potential account guessing attack against Windows accounts. Attackers may attempt
  to determine if a username exists by authenticating with a username and observing error messages received.
  The guessed usernames may be default accounts for applications or permutations the organization's naming
  convention. Once the attacker has determined if a username exists, they can target the existing accounts
  with password spraying attacks.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.credential-access
- attack.t1110
- detection.auth
- detection.credential-access
logsource:
  service: syslog
  product: linux
detection:
  selection:
    EventID:
    - 46255
    - 4625
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: '000037'
