title: Bulk File Access to Sensitive Directories
id: TDL-COL-002
status: stable
description: ''
references: []
author: TDL
date: '2024-03-11'
modified: '2026-04-27'
tags:
- attack.collection
- attack.t1074_001
- detection.data-staging
- detection.insider-threat
- detection.collection
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4663
  condition: selection
falsepositives:
- Authorized data analysts
- Batch processing jobs
level: high
