title: Mass File Download
id: TDL-COL-000062
status: stable
description: Detects when a user downloads multiple files from a file transfer/storage appliance. This
  could indicate a data exfiltration attempt by insider threat or a compromised user.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.collection
- attack.t1213
- detection.net
- detection.collection
logsource:
  service: office365
  product: m365
detection:
  selection:
    Keywords:
    - Mass File Download
  condition: selection
falsepositives:
- Authorized scanners
- Monitoring agents
level: low
custom:
  v4_id: '000062'
