title: AWS EC2 VM Export Attempt
id: TDL-COL-000427
status: experimental
description: Detects an attempt to export an AWS EC2 instance. An attacker would attempt to extract information
  from an instance.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.collection
- attack.t1005
- detection.auth
- detection.collection
logsource:
  service: cloudtrail
  product: aws
detection:
  selection:
    Keywords:
    - AWS EC2 VM Export Attempt
  condition: selection
falsepositives:
- 'False positives could be dev instances. Rule could be tuned to look for failures or successes.


  https://docs.aws.amazon.com/vm-import/latest/userguide'
level: low
custom:
  v4_id: '000427'
