title: Suspicious Archive Creation in Staging Directory
id: TDL-COL-001
status: stable
description: ''
references: []
author: TDL
date: '2024-03-10'
modified: '2026-04-27'
tags:
- attack.collection
- attack.t1560_001
- detection.archive
- detection.staging
- detection.collection
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4688
  condition: selection
falsepositives:
- IT staff creating manual backups
- Software deployment tools
level: high
