title: Registry Run Key Persistence Added
id: TDL-PER-001
status: stable
description: ''
references: []
author: TDL
date: '2024-01-20'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1547_001
- detection.registry
- detection.autorun
- detection.persistence
logsource:
  category: registry_set
  product: windows
detection:
  selection:
    Keywords:
    - Registry Run Key Persistence Added
  condition: selection
falsepositives:
- Software installers adding legitimate startup entries
level: high
