title: Printer Port Monitor DLL Injection
id: TDL-PER-000248
status: experimental
description: Detects when a new DLL is added to the printer port monitor. Port monitors can be set to
  run at startup by the printer servier spoolsv.exe. An attacker can register a malicious DLL that will
  be run by spoolsv.exe with SYSTEM level privileges.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1574
- detection.edp
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Printer Port Monitor DLL Injection
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: 000248
