title: WMI Event Subscription Created for Persistence
id: TDL-PER-004
status: stable
description: ''
references: []
author: TDL
date: '2024-01-22'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1546_003
- detection.wmi
- detection.persistence
- detection.fileless
logsource:
  category: wmi_event
  product: windows
detection:
  selection:
    EventID:
    - 19
    - 20
    - 21
  condition: selection
falsepositives:
- SCCM and management tools using WMI subscriptions
level: critical
