title: Task Manager Running as System
id: TDL-PER-000170
status: stable
description: Detects if Windows Task Manager process is running as the local system account. Attackers
  will attempt to hide themselves by imitating legitimate Windows system processes, however they are typically
  run as SYSTEM.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1543
- detection.edp
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
    - 2016
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000170'
