title: Ransomware Remnants Discovered - Varonis
id: TDL-PER-000646
status: stable
description: Detects remnants of ransomware identified on a host or backup image.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1547
- detection.edp
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    CommandLine|contains|any:
    - delete shadows
    - shadowcopy delete
    - resize shadowstorage
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000646'
