title: Startup File Modification - OSX
id: TDL-PER-000229
status: experimental
description: Detects when files related to configuring startup processes are modified in OSX. Attackers
  can create malicious plist files and place them in the LaunchAgent and LaunchDaemon directories, or
  modify the rc.common or launchd.conf files to configure the malicious process to run on the machines
  startup process to establish persistence.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1037
- detection.edp
- detection.persistence
logsource:
  category: generic
detection:
  selection:
    EventID:
    - 46631
    - 4663
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: 000229
