title: Netsh Helper DLL Injection
id: TDL-PER-000228
status: experimental
description: Detects when a new DLL is registered to Netsh or when Netsh spawns another process. Netsh
  is used to configure network settings on a Windows host. It can also extend its functionality by installer
  “helper” DLLs. An attacker can install a malicious helper DLL to run arbitrary code every time netsh
  is executed which allows for a persistant or foothold on the machine.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1574
- detection.edp
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 4688
    - 46571
    - 4657
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: 000228
