title: Azure Successful Powershell Login
id: TDL-PER-000369
status: stable
description: Detects a successful Azure login via Azure Powershell.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1098
- detection.auth
- detection.persistence
logsource:
  category: generic
detection:
  selection:
    EventID:
    - 1685
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: low
custom:
  v4_id: 000369
