title: New Service Created with Suspicious Executable Path
id: TDL-PER-002
status: stable
description: ''
references: []
author: TDL
date: '2024-01-20'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1543_003
- detection.service
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 7045
  condition: selection
falsepositives:
- Some legitimate software in non-standard paths
level: high
