title: Authentication Package DLL Injection
id: TDL-PER-000231
status: stable
description: Detects when a new authentication package DLL is registered. Authentication Packages provide
  support for different authentication security protocols, such as Kerberos or multifactor products. Since
  the authentication package DLLs are loaded at startup or reboot, an attacker can upload a malicious
  DLL to establish persistence on the machine.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.persistence
- attack.t1574
- detection.edp
- detection.persistence
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46571
    - 4657
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: medium
custom:
  v4_id: '000231'
