title: Kubernetes Pod Created with a hostPath Mount
id: TDL-PE-000582
status: experimental
description: 'Detects creation of a container with a hostPath mount. A hostPath volume mounts a directory
  or a file from the node to the container. Attackers who have permissions to create a new pod in the
  cluster may create one with a writable hostPath volume and chroot to escape to the underlying node.
  A sigma rule by Leo Tsaousis (@laripping)


  ref: https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/Writable%20hostPath%20mount/

  https://blog.appsecco.com/kubernetes-namespace-breakout-using-insecure-host-path-volume-part-1-b382f2a6e216'
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.privilege-escalation
- attack.t1611
- detection.edp
- detection.privilege-escalation
logsource:
  service: security
  product: windows
detection:
  selection:
    Keywords:
    - Kubernetes Pod Created with a hostPath Mount
  condition: selection
falsepositives:
- Security software
- Authorized admin tools
level: low
custom:
  v4_id: 000582
