title: Access denied for Service Account - GCP
id: TDL-PE-000321
status: stable
description: Detect when a GCP service account exhibits access denied behavior that deviates from normal.
references: []
author: TDL
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.privilege-escalation
- attack.t1078
- detection.auth
- detection.privilege-escalation
logsource:
  category: generic
detection:
  selection:
    Keywords:
    - Access denied for Service Account - GCP
  condition: selection
falsepositives:
- Legitimate admin activity
- Authorized service accounts
level: medium
custom:
  v4_id: '000321'
