title: Explorer Wermgr Potential Process Injection
id: TDL-PE-000361
status: stable
description: Detects suspicious command line arguments from potentially-injected versions of explorer
  or wermgr processes. This is a technique associated with QakBot malware. Investigate the parent process
  lineage to determine why these binaries are performing recon.
references: []
author: TDE/TDE
date: '2024-01-01'
modified: '2026-04-27'
tags:
- attack.privilege-escalation
- attack.t1055
- detection.edp
- detection.privilege-escalation
logsource:
  service: security
  product: windows
detection:
  selection:
    EventID:
    - 46881
    - 4688
  filter:
    Image|startswith|any:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  condition: selection and not filter
falsepositives:
- Security software
- Authorized admin tools
level: high
custom:
  v4_id: '000361'
